In [1]:
import numpy as np
import pandas as pd
from datetime import datetime

# Numpy

`Numpy` (Numerical Python) is one of the most important foundational packages for numerical computing in Python.
<br/>
One of the reason Numpy is important for numerical computations in Python is because it is designed for efficiency on large arrays of data

<ul>
    <li>
        Numpy internally stores data in a contiguous block of memory, independent of other built-in Python objects
    </li>
    <li>
        Uses much less memory than Python built-in sequences
    </li>
    <li>
        Numpy operations perform complex computations on entire arrays without the need for Python `for` loops
    </li>
</ul>

In [43]:
my_arr = np.arange(1_000_000)
%timeit my_arr2 = my_arr * 2

3.45 ms ± 243 μs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [44]:
my_list = list(range(1_000_000))
%timeit my_list2 = [x * 2 for x in my_list]

75.2 ms ± 7.83 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

Thea above result shows that if every item of numpy array is multiplied by 2, it takes roughly `3.61 ms` while the same operation on list takes nearly `85.7ms`

## Numpy array

One of the key featues of NumPy is its n-dimensional array object. Array enables you to perform mathematical operations on whole blocks of data using similar syntax to the equivalent operations between scalar elements. `In other words, it allows you to apply scalar operations to arrays that will otherwise require a loop in Python built-in list`

In [45]:
example_data = np.array([
    [1, 0.5, 6],
    [5, -3, 5.5]
])
print(f"Data: {example_data}\n")

print(f"Data doubled: {example_data * 2}\n")

print(f"Data added with itself: {example_data + example_data}")

Data: [[ 1.   0.5  6. ]
 [ 5.  -3.   5.5]]

Data doubled: [[ 2.  1. 12.]
 [10. -6. 11.]]

Data added with itself: [[ 2.  1. 12.]
 [10. -6. 11.]]

numpy array is a multidimensional container for homogeneous data (all of the elements must be of same data type)

In [46]:
# example_data = np.array([
#     [1, 0.5, 6],
#     [5, 'hello', 5.5]
# ])

# This will give error because an str is based in an float array. The integers are parsed to float

Easiest way to create an array is using `array()`

In [47]:
example_data = [6, 0.2, 3.6, 4.2]
example_data_array = np.array(example_data)
print(f'Array: {example_data_array}') # it may seems like a simple list but its type is different

print(f"Example data type: {type(example_data)}")
print(f"Example data array type: {type(example_data_array)}")

print(f"Example array dimensions: {example_data_array.ndim}")
print(f'Example array shape: {example_data_array.shape}')
print(f'Example array size: {example_data_array.size}')
print(f"Example array data type: {example_data_array.dtype}")

Array: [6.  0.2 3.6 4.2]
Example data type: <class 'list'>
Example data array type: <class 'numpy.ndarray'>
Example array dimensions: 1
Example array shape: (4,)
Example array size: 4
Example array data type: float64

You can explicitly cast an array from one type to another using ndarray `astype()`

In [48]:
print(f'Example array: {example_data_array}')

print(f'Example array type: {example_data_array.dtype}\n')

int_example_array = example_data_array.astype(np.int64)

print(f"Example array after type conversion to int: {int_example_array}")

print(f'Example array type: {int_example_array.dtype}\n')

Example array: [6.  0.2 3.6 4.2]
Example array type: float64

Example array after type conversion to int: [6 0 3 4]
Example array type: int64

If an array is of string numbers, it can be converted to float or integer. If casting were to fail (example string cannot be converted to integer or float), a `ValueError` will be raised

In [49]:
string_numbers_array = np.array(['1.2', '4.4', '0.5', '-1.6'])
print("Strings array: ", string_numbers_array)
print("Float numbers array type: ", string_numbers_array.dtype)

float_numbers_array = string_numbers_array.astype(np.float64)
print("\nFloat numbers array: ", float_numbers_array)
print("Float numbers array type: ", float_numbers_array.dtype)

Strings array:  ['1.2' '4.4' '0.5' '-1.6']
Float numbers array type:  <U4

Float numbers array:  [ 1.2  4.4  0.5 -1.6]
Float numbers array type:  float64

## Numpy functions

NumPy provides other functions for creating new arrays

In [50]:
print(f"Zero function: {np.zeros(5)}\n") #prints an array of zero

print(f"Zero matrix: {np.zeros((3,3))}\n")

print(f"Empty array: {np.empty((2,3))}\n") #prints an array with garbage values

print(f"Type of numpy.empty: {type(np.empty((2,2)))}\n")

print(f"Identity matrix: {np.eye(3)}\n") #identity matrix

print(f"Random matrix: {np.random.random((2, 2))}\n") #random matrix

print(f"Matrix of one: {np.ones((2,3))}\n")

print(f"Matrix of one while taking an another array as input: {np.ones_like(example_data)}\n") #ones_like takes another array and produces an array of ones array of same shape and size

print(f"Full numpy matrix: {np.full(3,5)}")

Zero function: [0. 0. 0. 0. 0.]

Zero matrix: [[0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]]

Empty array: [[ 1.   0.5  6. ]
 [ 5.  -3.   5.5]]

Type of numpy.empty: <class 'numpy.ndarray'>

Identity matrix: [[1. 0. 0.]
 [0. 1. 0.]
 [0. 0. 1.]]

Random matrix: [[0.24118228 0.10014174]
 [0.00405094 0.85246088]]

Matrix of one: [[1. 1. 1.]
 [1. 1. 1.]]

Matrix of one while taking an another array as input: [1. 1. 1. 1.]

Full numpy matrix: [5 5 5]

## Numpy Arrays Arithmetic

An important feature of a numpy array is that you can apply arithmetic operations without using loops. This is called `vectorization` <br/> <br/>
Vectorization refers to the process of performing operations on entire array at once rather iterating through individual elements using loop, leading to faster and more efficient code

In [51]:
example_array = np.array([[1., 2., 3.], [4., 5., 6.]])
print(f'Example array {example_array}')

Example array [[1. 2. 3.]
 [4. 5. 6.]]

In [52]:
print(f"Example array double: {example_array * 2}\n")

print(f"Example array square: {example_array * example_array}\n")

print(f"1 divided by example array {1/example_array}\n")

Example array double: [[ 2.  4.  6.]
 [ 8. 10. 12.]]

Example array square: [[ 1.  4.  9.]
 [16. 25. 36.]]

1 divided by example array [[1.         0.5        0.33333333]
 [0.25       0.2        0.16666667]]

We can compare two arrays. The comparison is done by element wise

In [53]:
example_array_2 = np.array([[0., 4., 1.], [7., 2., 12.]])

print(f"First example array: {example_array}\n")
print(f"Second example array: {example_array_2}")

First example array: [[1. 2. 3.]
 [4. 5. 6.]]

Second example array: [[ 0.  4.  1.]
 [ 7.  2. 12.]]

In [54]:
example_array > example_array_2

array([[ True, False,  True],
       [False,  True, False]])

In [55]:
example_array < example_array_2

array([[False,  True, False],
       [ True, False,  True]])

## Indexing and Slicing

Indexing and slicing of one-dimensional arrays are simple; on the surface they act similarly to Python lists

In [56]:
simple_array = np.arange(10)
print(f"Array: {simple_array}\n")

print(f"First element of array: {simple_array[0]}")
print(f"Last element of array {simple_array[-1]}")
print(f"3 to 5 element in array: {simple_array[2:5]}\n")

simple_array[5] = 15
print(f"Updating element at index 6: {simple_array}")

simple_array[0:2] = 56
print(f"Updating first 2 elements: {simple_array}")

Array: [0 1 2 3 4 5 6 7 8 9]

First element of array: 0
Last element of array 9
3 to 5 element in array: [2 3 4]

Updating element at index 6: [ 0  1  2  3  4 15  6  7  8  9]
Updating first 2 elements: [56 56  2  3  4 15  6  7  8  9]

In a two-dimensional array, the elements at each index are no longer scalars but rather one dimensional arrays

In [57]:
two_dimensional_array = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

print(f"Two dimensional array: {two_dimensional_array}")

print(f"\nFirst element: {two_dimensional_array[0][0]}")
print(f"Last element: {two_dimensional_array[2][2]}")

print(f"\nSecond row: {two_dimensional_array[1]}")
print(f"3 column: {two_dimensional_array[:, 2]}")
print(f"2 column: {two_dimensional_array[:, 1]}")

Two dimensional array: [[1 2 3]
 [4 5 6]
 [7 8 9]]

First element: 1
Last element: 9

Second row: [4 5 6]
3 column: [3 6 9]
2 column: [2 5 8]

In [58]:
print(f"Second and third row: {two_dimensional_array[1:3]}")
print(f"2 and third column: {two_dimensional_array[:, 1:3]}")

Second and third row: [[4 5 6]
 [7 8 9]]
2 and third column: [[2 3]
 [5 6]
 [8 9]]

Lets check for multi-dimensional arrays

In [59]:
three_dimensional_array = np.array([[[1, 2, 3], [4, 5, 6]],[[7, 8, 9], [10, 11, 12]]])

print(f"Multi dimensional array: {three_dimensional_array}")
print(f"\nMulti dimensional array dimension: {three_dimensional_array.ndim}")
print(f"Multi dimensional array shape: {three_dimensional_array.shape}")
print(f"Multi dimensional array size: {three_dimensional_array.size}")

print(f"\n First two dim array {three_dimensional_array[0]}") # returns a two dimensional array
print(f"Second one dim array {three_dimensional_array[1][1]}") # returns a one dimensional array
print(f"Third element of second one dim array {three_dimensional_array[1][1][2]}") # returns a scalar value

Multi dimensional array: [[[ 1  2  3]
  [ 4  5  6]]

 [[ 7  8  9]
  [10 11 12]]]

Multi dimensional array dimension: 3
Multi dimensional array shape: (2, 2, 3)
Multi dimensional array size: 12

 First two dim array [[1 2 3]
 [4 5 6]]
Second one dim array [10 11 12]
Third element of second one dim array 12

`Fancy indexing` refers to the practice of using arrays or lists of indices to access multiple elements of another array simultaneously. This allows for more flexible and powerful data manipuation

In [60]:
example_array = np.array([10, 20, 30, 40, 50])
print(f'Example array: {example_array}')
indices = [1, 3, 4]

print(f"Selected elements: {example_array[indices]}")

print(f"\nTwo dimensional array: {two_dimensional_array}")

# Selects elements at (0, 2), (1, 1), and (2, 0)
print(f"Selected elements: {two_dimensional_array[[0, 1, 2], [2, 1, 0]]}")

Example array: [10 20 30 40 50]
Selected elements: [20 40 50]

Two dimensional array: [[1 2 3]
 [4 5 6]
 [7 8 9]]
Selected elements: [3 5 7]

`Transposing` is a special form of reshaping that interchanges the column data with row data. `The row becomes columns and the columns become rows`

In [61]:
example_array = np.arange(15).reshape((3, 5))
print(f"Example array:\n {example_array}")

print(f"\nExample array transpose: {example_array.T}")

Example array:
 [[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]]

Example array transpose: [[ 0  5 10]
 [ 1  6 11]
 [ 2  7 12]
 [ 3  8 13]
 [ 4  9 14]]

We can also do `dot multiplication`

In [62]:
print(f"Dot product of example array and transpose of example array: {np.dot(example_array, example_array.T)}")

Dot product of example array and transpose of example array: [[ 30  80 130]
 [ 80 255 430]
 [130 430 730]]

`numpy.random` is used to generate array of random data

In [63]:
samples = np.random.standard_normal(size=(4, 4))
print(f"Sample data: \n{samples}")

Sample data:
[[ 1.58609982 -2.61648497  1.03505485  0.87792269]
 [-0.98787894 -1.29431431  0.04279451 -0.16863342]
 [ 0.68271307 -0.46911851 -0.58927356  0.19659037]
 [-0.07528957 -2.05001127  0.28337902 -0.66659274]]

In [64]:
random_number_generator = np.random.default_rng(seed = 12345) # seed argument determines the initial state of the generator

samples = random_number_generator.standard_normal((2, 3))

print(f"Sample data: \n{samples}")

Sample data:
[[-1.42382504  1.26372846 -0.87066174]
 [-0.25917323 -0.07534331 -0.74088465]]

Numpy has `universal function` that performs element-wise operations on data in arrays

In [65]:
print(f"Samples: \n{samples}")
print(f"\nSquare of array elements: \n{np.square(samples)}")

Samples:
[[-1.42382504  1.26372846 -0.87066174]
 [-0.25917323 -0.07534331 -0.74088465]]

Square of array elements:
[[2.02727773 1.59700962 0.75805186]
 [0.06717077 0.00567661 0.54891007]]

`numpy.meshgrid()` takes one-dimensional array and produces two-dimensional matrics corresponding to all pairs of (x, y) in the two arrays

In [66]:
points = np.arange(-5, 5, 0.01)
print(f"Points: {points}")

Points: [-5.0000000e+00 -4.9900000e+00 -4.9800000e+00 -4.9700000e+00
 -4.9600000e+00 -4.9500000e+00 -4.9400000e+00 -4.9300000e+00
 -4.9200000e+00 -4.9100000e+00 -4.9000000e+00 -4.8900000e+00
 -4.8800000e+00 -4.8700000e+00 -4.8600000e+00 -4.8500000e+00
 -4.8400000e+00 -4.8300000e+00 -4.8200000e+00 -4.8100000e+00
 -4.8000000e+00 -4.7900000e+00 -4.7800000e+00 -4.7700000e+00
 -4.7600000e+00 -4.7500000e+00 -4.7400000e+00 -4.7300000e+00
 -4.7200000e+00 -4.7100000e+00 -4.7000000e+00 -4.6900000e+00
 -4.6800000e+00 -4.6700000e+00 -4.6600000e+00 -4.6500000e+00
 -4.6400000e+00 -4.6300000e+00 -4.6200000e+00 -4.6100000e+00
 -4.6000000e+00 -4.5900000e+00 -4.5800000e+00 -4.5700000e+00
 -4.5600000e+00 -4.5500000e+00 -4.5400000e+00 -4.5300000e+00
 -4.5200000e+00 -4.5100000e+00 -4.5000000e+00 -4.4900000e+00
 -4.4800000e+00 -4.4700000e+00 -4.4600000e+00 -4.4500000e+00
 -4.4400000e+00 -4.4300000e+00 -4.4200000e+00 -4.4100000e+00
 -4.4000000e+00 -4.3900000e+00 -4.3800000e+00 -4.3700000e+00
 -4.3600000e+00 -4.3500000e+00 -4.3400000e+00 -4.3300000e+00
 -4.3200000e+00 -4.3100000e+00 -4.3000000e+00 -4.2900000e+00
 -4.2800000e+00 -4.2700000e+00 -4.2600000e+00 -4.2500000e+00
 -4.2400000e+00 -4.2300000e+00 -4.2200000e+00 -4.2100000e+00
 -4.2000000e+00 -4.1900000e+00 -4.1800000e+00 -4.1700000e+00
 -4.1600000e+00 -4.1500000e+00 -4.1400000e+00 -4.1300000e+00
 -4.1200000e+00 -4.1100000e+00 -4.1000000e+00 -4.0900000e+00
 -4.0800000e+00 -4.0700000e+00 -4.0600000e+00 -4.0500000e+00
 -4.0400000e+00 -4.0300000e+00 -4.0200000e+00 -4.0100000e+00
 -4.0000000e+00 -3.9900000e+00 -3.9800000e+00 -3.9700000e+00
 -3.9600000e+00 -3.9500000e+00 -3.9400000e+00 -3.9300000e+00
 -3.9200000e+00 -3.9100000e+00 -3.9000000e+00 -3.8900000e+00
 -3.8800000e+00 -3.8700000e+00 -3.8600000e+00 -3.8500000e+00
 -3.8400000e+00 -3.8300000e+00 -3.8200000e+00 -3.8100000e+00
 -3.8000000e+00 -3.7900000e+00 -3.7800000e+00 -3.7700000e+00
 -3.7600000e+00 -3.7500000e+00 -3.7400000e+00 -3.7300000e+00
 -3.7200000e+00 -3.7100000e+00 -3.7000000e+00 -3.6900000e+00
 -3.6800000e+00 -3.6700000e+00 -3.6600000e+00 -3.6500000e+00
 -3.6400000e+00 -3.6300000e+00 -3.6200000e+00 -3.6100000e+00
 -3.6000000e+00 -3.5900000e+00 -3.5800000e+00 -3.5700000e+00
 -3.5600000e+00 -3.5500000e+00 -3.5400000e+00 -3.5300000e+00
 -3.5200000e+00 -3.5100000e+00 -3.5000000e+00 -3.4900000e+00
 -3.4800000e+00 -3.4700000e+00 -3.4600000e+00 -3.4500000e+00
 -3.4400000e+00 -3.4300000e+00 -3.4200000e+00 -3.4100000e+00
 -3.4000000e+00 -3.3900000e+00 -3.3800000e+00 -3.3700000e+00
 -3.3600000e+00 -3.3500000e+00 -3.3400000e+00 -3.3300000e+00
 -3.3200000e+00 -3.3100000e+00 -3.3000000e+00 -3.2900000e+00
 -3.2800000e+00 -3.2700000e+00 -3.2600000e+00 -3.2500000e+00
 -3.2400000e+00 -3.2300000e+00 -3.2200000e+00 -3.2100000e+00
 -3.2000000e+00 -3.1900000e+00 -3.1800000e+00 -3.1700000e+00
 -3.1600000e+00 -3.1500000e+00 -3.1400000e+00 -3.1300000e+00
 -3.1200000e+00 -3.1100000e+00 -3.1000000e+00 -3.0900000e+00
 -3.0800000e+00 -3.0700000e+00 -3.0600000e+00 -3.0500000e+00
 -3.0400000e+00 -3.0300000e+00 -3.0200000e+00 -3.0100000e+00
 -3.0000000e+00 -2.9900000e+00 -2.9800000e+00 -2.9700000e+00
 -2.9600000e+00 -2.9500000e+00 -2.9400000e+00 -2.9300000e+00
 -2.9200000e+00 -2.9100000e+00 -2.9000000e+00 -2.8900000e+00
 -2.8800000e+00 -2.8700000e+00 -2.8600000e+00 -2.8500000e+00
 -2.8400000e+00 -2.8300000e+00 -2.8200000e+00 -2.8100000e+00
 -2.8000000e+00 -2.7900000e+00 -2.7800000e+00 -2.7700000e+00
 -2.7600000e+00 -2.7500000e+00 -2.7400000e+00 -2.7300000e+00
 -2.7200000e+00 -2.7100000e+00 -2.7000000e+00 -2.6900000e+00
 -2.6800000e+00 -2.6700000e+00 -2.6600000e+00 -2.6500000e+00
 -2.6400000e+00 -2.6300000e+00 -2.6200000e+00 -2.6100000e+00
 -2.6000000e+00 -2.5900000e+00 -2.5800000e+00 -2.5700000e+00
 -2.5600000e+00 -2.5500000e+00 -2.5400000e+00 -2.5300000e+00
 -2.5200000e+00 -2.5100000e+00 -2.5000000e+00 -2.4900000e+00
 -2.4800000e+00 -2.4700000e+00 -2.4600000e+00 -2.4500000e+00
 -2.4400000e+00 -2.4300000e+00 -2.4200000e+00 -2.4100000e+00
 -2.4000000e+00 -2.3900000e+00 -2.3800000e+00 -2.3700000e+00
 -2.3600000e+00 -2.3500000e+00 -2.3400000e+00 -2.3300000e+00
 -2.3200000e+00 -2.3100000e+00 -2.3000000e+00 -2.2900000e+00
 -2.2800000e+00 -2.2700000e+00 -2.2600000e+00 -2.2500000e+00
 -2.2400000e+00 -2.2300000e+00 -2.2200000e+00 -2.2100000e+00
 -2.2000000e+00 -2.1900000e+00 -2.1800000e+00 -2.1700000e+00
 -2.1600000e+00 -2.1500000e+00 -2.1400000e+00 -2.1300000e+00
 -2.1200000e+00 -2.1100000e+00 -2.1000000e+00 -2.0900000e+00
 -2.0800000e+00 -2.0700000e+00 -2.0600000e+00 -2.0500000e+00
 -2.0400000e+00 -2.0300000e+00 -2.0200000e+00 -2.0100000e+00
 -2.0000000e+00 -1.9900000e+00 -1.9800000e+00 -1.9700000e+00
 -1.9600000e+00 -1.9500000e+00 -1.9400000e+00 -1.9300000e+00
 -1.9200000e+00 -1.9100000e+00 -1.9000000e+00 -1.8900000e+00
 -1.8800000e+00 -1.8700000e+00 -1.8600000e+00 -1.8500000e+00
 -1.8400000e+00 -1.8300000e+00 -1.8200000e+00 -1.8100000e+00
 -1.8000000e+00 -1.7900000e+00 -1.7800000e+00 -1.7700000e+00
 -1.7600000e+00 -1.7500000e+00 -1.7400000e+00 -1.7300000e+00
 -1.7200000e+00 -1.7100000e+00 -1.7000000e+00 -1.6900000e+00
 -1.6800000e+00 -1.6700000e+00 -1.6600000e+00 -1.6500000e+00
 -1.6400000e+00 -1.6300000e+00 -1.6200000e+00 -1.6100000e+00
 -1.6000000e+00 -1.5900000e+00 -1.5800000e+00 -1.5700000e+00
 -1.5600000e+00 -1.5500000e+00 -1.5400000e+00 -1.5300000e+00
 -1.5200000e+00 -1.5100000e+00 -1.5000000e+00 -1.4900000e+00
 -1.4800000e+00 -1.4700000e+00 -1.4600000e+00 -1.4500000e+00
 -1.4400000e+00 -1.4300000e+00 -1.4200000e+00 -1.4100000e+00
 -1.4000000e+00 -1.3900000e+00 -1.3800000e+00 -1.3700000e+00
 -1.3600000e+00 -1.3500000e+00 -1.3400000e+00 -1.3300000e+00
 -1.3200000e+00 -1.3100000e+00 -1.3000000e+00 -1.2900000e+00
 -1.2800000e+00 -1.2700000e+00 -1.2600000e+00 -1.2500000e+00
 -1.2400000e+00 -1.2300000e+00 -1.2200000e+00 -1.2100000e+00
 -1.2000000e+00 -1.1900000e+00 -1.1800000e+00 -1.1700000e+00
 -1.1600000e+00 -1.1500000e+00 -1.1400000e+00 -1.1300000e+00
 -1.1200000e+00 -1.1100000e+00 -1.1000000e+00 -1.0900000e+00
 -1.0800000e+00 -1.0700000e+00 -1.0600000e+00 -1.0500000e+00
 -1.0400000e+00 -1.0300000e+00 -1.0200000e+00 -1.0100000e+00
 -1.0000000e+00 -9.9000000e-01 -9.8000000e-01 -9.7000000e-01
 -9.6000000e-01 -9.5000000e-01 -9.4000000e-01 -9.3000000e-01
 -9.2000000e-01 -9.1000000e-01 -9.0000000e-01 -8.9000000e-01
 -8.8000000e-01 -8.7000000e-01 -8.6000000e-01 -8.5000000e-01
 -8.4000000e-01 -8.3000000e-01 -8.2000000e-01 -8.1000000e-01
 -8.0000000e-01 -7.9000000e-01 -7.8000000e-01 -7.7000000e-01
 -7.6000000e-01 -7.5000000e-01 -7.4000000e-01 -7.3000000e-01
 -7.2000000e-01 -7.1000000e-01 -7.0000000e-01 -6.9000000e-01
 -6.8000000e-01 -6.7000000e-01 -6.6000000e-01 -6.5000000e-01
 -6.4000000e-01 -6.3000000e-01 -6.2000000e-01 -6.1000000e-01
 -6.0000000e-01 -5.9000000e-01 -5.8000000e-01 -5.7000000e-01
 -5.6000000e-01 -5.5000000e-01 -5.4000000e-01 -5.3000000e-01
 -5.2000000e-01 -5.1000000e-01 -5.0000000e-01 -4.9000000e-01
 -4.8000000e-01 -4.7000000e-01 -4.6000000e-01 -4.5000000e-01
 -4.4000000e-01 -4.3000000e-01 -4.2000000e-01 -4.1000000e-01
 -4.0000000e-01 -3.9000000e-01 -3.8000000e-01 -3.7000000e-01
 -3.6000000e-01 -3.5000000e-01 -3.4000000e-01 -3.3000000e-01
 -3.2000000e-01 -3.1000000e-01 -3.0000000e-01 -2.9000000e-01
 -2.8000000e-01 -2.7000000e-01 -2.6000000e-01 -2.5000000e-01
 -2.4000000e-01 -2.3000000e-01 -2.2000000e-01 -2.1000000e-01
 -2.0000000e-01 -1.9000000e-01 -1.8000000e-01 -1.7000000e-01
 -1.6000000e-01 -1.5000000e-01 -1.4000000e-01 -1.3000000e-01
 -1.2000000e-01 -1.1000000e-01 -1.0000000e-01 -9.0000000e-02
 -8.0000000e-02 -7.0000000e-02 -6.0000000e-02 -5.0000000e-02
 -4.0000000e-02 -3.0000000e-02 -2.0000000e-02 -1.0000000e-02
 -1.0658141e-13  1.0000000e-02  2.0000000e-02  3.0000000e-02
  4.0000000e-02  5.0000000e-02  6.0000000e-02  7.0000000e-02
  8.0000000e-02  9.0000000e-02  1.0000000e-01  1.1000000e-01
  1.2000000e-01  1.3000000e-01  1.4000000e-01  1.5000000e-01
  1.6000000e-01  1.7000000e-01  1.8000000e-01  1.9000000e-01
  2.0000000e-01  2.1000000e-01  2.2000000e-01  2.3000000e-01
  2.4000000e-01  2.5000000e-01  2.6000000e-01  2.7000000e-01
  2.8000000e-01  2.9000000e-01  3.0000000e-01  3.1000000e-01
  3.2000000e-01  3.3000000e-01  3.4000000e-01  3.5000000e-01
  3.6000000e-01  3.7000000e-01  3.8000000e-01  3.9000000e-01
  4.0000000e-01  4.1000000e-01  4.2000000e-01  4.3000000e-01
  4.4000000e-01  4.5000000e-01  4.6000000e-01  4.7000000e-01
  4.8000000e-01  4.9000000e-01  5.0000000e-01  5.1000000e-01
  5.2000000e-01  5.3000000e-01  5.4000000e-01  5.5000000e-01
  5.6000000e-01  5.7000000e-01  5.8000000e-01  5.9000000e-01
  6.0000000e-01  6.1000000e-01  6.2000000e-01  6.3000000e-01
  6.4000000e-01  6.5000000e-01  6.6000000e-01  6.7000000e-01
  6.8000000e-01  6.9000000e-01  7.0000000e-01  7.1000000e-01
  7.2000000e-01  7.3000000e-01  7.4000000e-01  7.5000000e-01
  7.6000000e-01  7.7000000e-01  7.8000000e-01  7.9000000e-01
  8.0000000e-01  8.1000000e-01  8.2000000e-01  8.3000000e-01
  8.4000000e-01  8.5000000e-01  8.6000000e-01  8.7000000e-01
  8.8000000e-01  8.9000000e-01  9.0000000e-01  9.1000000e-01
  9.2000000e-01  9.3000000e-01  9.4000000e-01  9.5000000e-01
  9.6000000e-01  9.7000000e-01  9.8000000e-01  9.9000000e-01
  1.0000000e+00  1.0100000e+00  1.0200000e+00  1.0300000e+00
  1.0400000e+00  1.0500000e+00  1.0600000e+00  1.0700000e+00
  1.0800000e+00  1.0900000e+00  1.1000000e+00  1.1100000e+00
  1.1200000e+00  1.1300000e+00  1.1400000e+00  1.1500000e+00
  1.1600000e+00  1.1700000e+00  1.1800000e+00  1.1900000e+00
  1.2000000e+00  1.2100000e+00  1.2200000e+00  1.2300000e+00
  1.2400000e+00  1.2500000e+00  1.2600000e+00  1.2700000e+00
  1.2800000e+00  1.2900000e+00  1.3000000e+00  1.3100000e+00
  1.3200000e+00  1.3300000e+00  1.3400000e+00  1.3500000e+00
  1.3600000e+00  1.3700000e+00  1.3800000e+00  1.3900000e+00
  1.4000000e+00  1.4100000e+00  1.4200000e+00  1.4300000e+00
  1.4400000e+00  1.4500000e+00  1.4600000e+00  1.4700000e+00
  1.4800000e+00  1.4900000e+00  1.5000000e+00  1.5100000e+00
  1.5200000e+00  1.5300000e+00  1.5400000e+00  1.5500000e+00
  1.5600000e+00  1.5700000e+00  1.5800000e+00  1.5900000e+00
  1.6000000e+00  1.6100000e+00  1.6200000e+00  1.6300000e+00
  1.6400000e+00  1.6500000e+00  1.6600000e+00  1.6700000e+00
  1.6800000e+00  1.6900000e+00  1.7000000e+00  1.7100000e+00
  1.7200000e+00  1.7300000e+00  1.7400000e+00  1.7500000e+00
  1.7600000e+00  1.7700000e+00  1.7800000e+00  1.7900000e+00
  1.8000000e+00  1.8100000e+00  1.8200000e+00  1.8300000e+00
  1.8400000e+00  1.8500000e+00  1.8600000e+00  1.8700000e+00
  1.8800000e+00  1.8900000e+00  1.9000000e+00  1.9100000e+00
  1.9200000e+00  1.9300000e+00  1.9400000e+00  1.9500000e+00
  1.9600000e+00  1.9700000e+00  1.9800000e+00  1.9900000e+00
  2.0000000e+00  2.0100000e+00  2.0200000e+00  2.0300000e+00
  2.0400000e+00  2.0500000e+00  2.0600000e+00  2.0700000e+00
  2.0800000e+00  2.0900000e+00  2.1000000e+00  2.1100000e+00
  2.1200000e+00  2.1300000e+00  2.1400000e+00  2.1500000e+00
  2.1600000e+00  2.1700000e+00  2.1800000e+00  2.1900000e+00
  2.2000000e+00  2.2100000e+00  2.2200000e+00  2.2300000e+00
  2.2400000e+00  2.2500000e+00  2.2600000e+00  2.2700000e+00
  2.2800000e+00  2.2900000e+00  2.3000000e+00  2.3100000e+00
  2.3200000e+00  2.3300000e+00  2.3400000e+00  2.3500000e+00
  2.3600000e+00  2.3700000e+00  2.3800000e+00  2.3900000e+00
  2.4000000e+00  2.4100000e+00  2.4200000e+00  2.4300000e+00
  2.4400000e+00  2.4500000e+00  2.4600000e+00  2.4700000e+00
  2.4800000e+00  2.4900000e+00  2.5000000e+00  2.5100000e+00
  2.5200000e+00  2.5300000e+00  2.5400000e+00  2.5500000e+00
  2.5600000e+00  2.5700000e+00  2.5800000e+00  2.5900000e+00
  2.6000000e+00  2.6100000e+00  2.6200000e+00  2.6300000e+00
  2.6400000e+00  2.6500000e+00  2.6600000e+00  2.6700000e+00
  2.6800000e+00  2.6900000e+00  2.7000000e+00  2.7100000e+00
  2.7200000e+00  2.7300000e+00  2.7400000e+00  2.7500000e+00
  2.7600000e+00  2.7700000e+00  2.7800000e+00  2.7900000e+00
  2.8000000e+00  2.8100000e+00  2.8200000e+00  2.8300000e+00
  2.8400000e+00  2.8500000e+00  2.8600000e+00  2.8700000e+00
  2.8800000e+00  2.8900000e+00  2.9000000e+00  2.9100000e+00
  2.9200000e+00  2.9300000e+00  2.9400000e+00  2.9500000e+00
  2.9600000e+00  2.9700000e+00  2.9800000e+00  2.9900000e+00
  3.0000000e+00  3.0100000e+00  3.0200000e+00  3.0300000e+00
  3.0400000e+00  3.0500000e+00  3.0600000e+00  3.0700000e+00
  3.0800000e+00  3.0900000e+00  3.1000000e+00  3.1100000e+00
  3.1200000e+00  3.1300000e+00  3.1400000e+00  3.1500000e+00
  3.1600000e+00  3.1700000e+00  3.1800000e+00  3.1900000e+00
  3.2000000e+00  3.2100000e+00  3.2200000e+00  3.2300000e+00
  3.2400000e+00  3.2500000e+00  3.2600000e+00  3.2700000e+00
  3.2800000e+00  3.2900000e+00  3.3000000e+00  3.3100000e+00
  3.3200000e+00  3.3300000e+00  3.3400000e+00  3.3500000e+00
  3.3600000e+00  3.3700000e+00  3.3800000e+00  3.3900000e+00
  3.4000000e+00  3.4100000e+00  3.4200000e+00  3.4300000e+00
  3.4400000e+00  3.4500000e+00  3.4600000e+00  3.4700000e+00
  3.4800000e+00  3.4900000e+00  3.5000000e+00  3.5100000e+00
  3.5200000e+00  3.5300000e+00  3.5400000e+00  3.5500000e+00
  3.5600000e+00  3.5700000e+00  3.5800000e+00  3.5900000e+00
  3.6000000e+00  3.6100000e+00  3.6200000e+00  3.6300000e+00
  3.6400000e+00  3.6500000e+00  3.6600000e+00  3.6700000e+00
  3.6800000e+00  3.6900000e+00  3.7000000e+00  3.7100000e+00
  3.7200000e+00  3.7300000e+00  3.7400000e+00  3.7500000e+00
  3.7600000e+00  3.7700000e+00  3.7800000e+00  3.7900000e+00
  3.8000000e+00  3.8100000e+00  3.8200000e+00  3.8300000e+00
  3.8400000e+00  3.8500000e+00  3.8600000e+00  3.8700000e+00
  3.8800000e+00  3.8900000e+00  3.9000000e+00  3.9100000e+00
  3.9200000e+00  3.9300000e+00  3.9400000e+00  3.9500000e+00
  3.9600000e+00  3.9700000e+00  3.9800000e+00  3.9900000e+00
  4.0000000e+00  4.0100000e+00  4.0200000e+00  4.0300000e+00
  4.0400000e+00  4.0500000e+00  4.0600000e+00  4.0700000e+00
  4.0800000e+00  4.0900000e+00  4.1000000e+00  4.1100000e+00
  4.1200000e+00  4.1300000e+00  4.1400000e+00  4.1500000e+00
  4.1600000e+00  4.1700000e+00  4.1800000e+00  4.1900000e+00
  4.2000000e+00  4.2100000e+00  4.2200000e+00  4.2300000e+00
  4.2400000e+00  4.2500000e+00  4.2600000e+00  4.2700000e+00
  4.2800000e+00  4.2900000e+00  4.3000000e+00  4.3100000e+00
  4.3200000e+00  4.3300000e+00  4.3400000e+00  4.3500000e+00
  4.3600000e+00  4.3700000e+00  4.3800000e+00  4.3900000e+00
  4.4000000e+00  4.4100000e+00  4.4200000e+00  4.4300000e+00
  4.4400000e+00  4.4500000e+00  4.4600000e+00  4.4700000e+00
  4.4800000e+00  4.4900000e+00  4.5000000e+00  4.5100000e+00
  4.5200000e+00  4.5300000e+00  4.5400000e+00  4.5500000e+00
  4.5600000e+00  4.5700000e+00  4.5800000e+00  4.5900000e+00
  4.6000000e+00  4.6100000e+00  4.6200000e+00  4.6300000e+00
  4.6400000e+00  4.6500000e+00  4.6600000e+00  4.6700000e+00
  4.6800000e+00  4.6900000e+00  4.7000000e+00  4.7100000e+00
  4.7200000e+00  4.7300000e+00  4.7400000e+00  4.7500000e+00
  4.7600000e+00  4.7700000e+00  4.7800000e+00  4.7900000e+00
  4.8000000e+00  4.8100000e+00  4.8200000e+00  4.8300000e+00
  4.8400000e+00  4.8500000e+00  4.8600000e+00  4.8700000e+00
  4.8800000e+00  4.8900000e+00  4.9000000e+00  4.9100000e+00
  4.9200000e+00  4.9300000e+00  4.9400000e+00  4.9500000e+00
  4.9600000e+00  4.9700000e+00  4.9800000e+00  4.9900000e+00]

In [67]:
xs, ys = np.meshgrid(points, points)
print(f"X points: \n{xs}")
print(f"\nY points: \n{ys}")

X points:
[[-5.   -4.99 -4.98 ...  4.97  4.98  4.99]
 [-5.   -4.99 -4.98 ...  4.97  4.98  4.99]
 [-5.   -4.99 -4.98 ...  4.97  4.98  4.99]
 ...
 [-5.   -4.99 -4.98 ...  4.97  4.98  4.99]
 [-5.   -4.99 -4.98 ...  4.97  4.98  4.99]
 [-5.   -4.99 -4.98 ...  4.97  4.98  4.99]]

Y points:
[[-5.   -5.   -5.   ... -5.   -5.   -5.  ]
 [-4.99 -4.99 -4.99 ... -4.99 -4.99 -4.99]
 [-4.98 -4.98 -4.98 ... -4.98 -4.98 -4.98]
 ...
 [ 4.97  4.97  4.97 ...  4.97  4.97  4.97]
 [ 4.98  4.98  4.98 ...  4.98  4.98  4.98]
 [ 4.99  4.99  4.99 ...  4.99  4.99  4.99]]

`numpy.where()` function is a vectorized verison of terenary expression (x if condition else y)

In [68]:
xarr = np.array([1.1, 1.2, 1.3, 1.4, 1.5])
yarr = np.array([2.1, 2.2, 2.3, 2.4, 2.5])
cond = np.array([True, False, True, True, False])

result = [(x if c else y)for x, y, c in zip(xarr, yarr, cond)]
print(f"Result of traditional terenay operation \n{result}")

result = np.where(cond, xarr, yarr)
print(f"\nResult of np.where {result}")

Result of traditional terenay operation
[np.float64(1.1), np.float64(2.2), np.float64(1.3), np.float64(1.4), np.float64(2.5)]

Result of np.where [1.1 2.2 1.3 1.4 2.5]

We can sort using `.sort()`

In [69]:
arr2 = np.array([5, -10, 7, 1, 0, -3])
print(f"Samples: \n{arr2}")

sorted_arr2 = np.sort(arr2)

print(f"Sorted array: \n{sorted_arr2}")

Samples:
[  5 -10   7   1   0  -3]
Sorted array:
[-10  -3   0   1   5   7]

In [70]:
samples = np.random.standard_normal((5, 3))
print(f"Sample: \n{samples}")

samples.sort(axis=0)
print(f"\nSample sorted by column \n{samples}")

samples.sort(axis=1)
print(f"\nSample sorted by row \n{samples}")

Sample:
[[ 3.34049734e-01 -1.41453850e+00  1.17720242e-02]
 [ 3.68256266e-01 -8.80881209e-02 -9.99436879e-02]
 [-9.44493098e-04  3.41581657e-02  8.50378186e-01]
 [ 7.01146371e-01 -5.09480603e-01  1.23175265e+00]
 [-1.26360052e+00 -8.75687937e-01 -4.14038410e-01]]

Sample sorted by column
[[-1.26360052e+00 -1.41453850e+00 -4.14038410e-01]
 [-9.44493098e-04 -8.75687937e-01 -9.99436879e-02]
 [ 3.34049734e-01 -5.09480603e-01  1.17720242e-02]
 [ 3.68256266e-01 -8.80881209e-02  8.50378186e-01]
 [ 7.01146371e-01  3.41581657e-02  1.23175265e+00]]

Sample sorted by row
[[-1.41453850e+00 -1.26360052e+00 -4.14038410e-01]
 [-8.75687937e-01 -9.99436879e-02 -9.44493098e-04]
 [-5.09480603e-01  1.17720242e-02  3.34049734e-01]
 [-8.80881209e-02  3.68256266e-01  8.50378186e-01]
 [ 3.41581657e-02  7.01146371e-01  1.23175265e+00]]

We can find unique values in an array using `np.unique()`

In [71]:
print(f"Unique values in samples {np.unique(samples)}")

Unique values in samples [-1.41453850e+00 -1.26360052e+00 -8.75687937e-01 -5.09480603e-01
 -4.14038410e-01 -9.99436879e-02 -8.80881209e-02 -9.44493098e-04
  1.17720242e-02  3.41581657e-02  3.34049734e-01  3.68256266e-01
  7.01146371e-01  8.50378186e-01  1.23175265e+00]

# Pandas

`pandas` is powerful and widely open source data manipulation and analysis library. It is built on top of NumPy and provides data structure and functions needed to work with structured data seamlessly

It is commonly used for

<ul>
    <li>
        Data cleaning and pre-processing like handling missing values, transforming data types, and normalizing data
    </li>
    <li>
        Exploratory data analysis that includes summarizing data, calculating statisitcs, and visualizing data
    </li>
    <li>
        Data wrangling that includes reshaping, merging, and filtering large datasets
    </li>
    <li>
        Data transformation that includes applying functions and transformations to data
    </li>
    <li>
        Time series analysis that includes working with date-time data for analysis and forecasting
    </li>
</ul>

## Series

`Series` is a one-dimensional array like object containing a sequence of values of the same type and an associated array of data labels called index

In [72]:
companies = ['Apple', 'Samsung', 'Alphabet', 'Foxconn', 'Microsoft', 'Huawei', 'Dell Technlogoies', 'Meta', 'Sony']

revenue = [274_515, 200_734, 182_257, 181_945, 143_015, 129_184, 92_224, 85_965, 84_893]

annual_report = pd.Series(revenue, index=companies, name='Annual Revenue')

display(annual_report)

Apple                274515
Samsung              200734
Alphabet             182257
Foxconn              181945
Microsoft            143015
Huawei               129184
Dell Technlogoies     92224
Meta                  85965
Sony                  84893
Name: Annual Revenue, dtype: int64

The main component of series are:

<ul>
    <li>
        Data:
        <ul>
            <li>
                This is the most important component of the series. This the data we want to represent
            </li>
        </ul>
    </li>
    <li>
        Index:
        <ul>
            <li>
                The index indicates the "labels" of the data we are storing. It is not a required parameter as pandas assign default sequential numbers if index is not provided
            </li>
        </ul>
    </li>
    <li>
        Name:
        <ul>
            <li>
                This is sort of documentation that gives name to the table. This is also optional
            </li>
        </ul>
    </li>
</ul>

Series are `strongly typed`; they have an enforced object type. A series of dtype int64 will consist only int64

We can get data of Series by `index`, by `position` and also by multiple of those
<br/> <br/>
We use the Series index to reference and locate date associated with it. `Series.loc['index']` is the prefered method to reference values

In [73]:
print(f"Annual revenue of Apple: ${annual_report['Apple']}") # get the value associated with index 'Apple'
print(f"Annual Revenue of Meta: ${annual_report.get('Meta')}") # another way to get data associated with an index

# print(f"Annual revenue of Nvidia: ${annual_report['Nvidia']}") # This will give error because there is no index Nvidia
# alternative is to use .get() which handles error properly

print(f"Annual revenue of Nvidia: ${annual_report.get('Nvidia')}")

print(f"Annual revenue of Samsung: ${annual_report.loc['Samsung']}") # another method to get associated with key

print(f"Annual revenue of Alphabet and Dell: \n{annual_report.loc[['Alphabet', 'Dell Technlogoies']]}")

Annual revenue of Apple: $274515
Annual Revenue of Meta: $85965
Annual revenue of Nvidia: $None
Annual revenue of Samsung: $200734
Annual revenue of Alphabet and Dell:
Alphabet             182257
Dell Technlogoies     92224
Name: Annual Revenue, dtype: int64

We can select elements by their position or order. `.iloc[]` method is used

In [74]:
print(f"First data in the series: {annual_report.iloc[1]}")
print(f"Last data in the series: {annual_report.iloc[-1]}")
print(f"Data at first, 5 and last index: \n{annual_report.iloc[[0, 5, -1]]}")

First data in the series: 200734
Last data in the series: 84893
Data at first, 5 and last index:
Apple     274515
Huawei    129184
Sony       84893
Name: Annual Revenue, dtype: int64

A series can be converted back to a dictionary using `to_dict()` method

In [75]:
print(f"Dictionary version of the series: {annual_report.to_dict()}")

Dictionary version of the series: {'Apple': 274515, 'Samsung': 200734, 'Alphabet': 182257, 'Foxconn': 181945, 'Microsoft': 143015, 'Huawei': 129184, 'Dell Technlogoies': 92224, 'Meta': 85965, 'Sony': 84893}

The `isna()` function is used to detect missing, NA or null values

In [76]:
print(f"Missing values in series: {pd.isna(annual_report)}")

Missing values in series: Apple                False
Samsung              False
Alphabet             False
Foxconn              False
Microsoft            False
Huawei               False
Dell Technlogoies    False
Meta                 False
Sony                 False
Name: Annual Revenue, dtype: bool

To check if the values is not null or NA or missing, you can use `notna()`

In [77]:
print(f"Non-null values in the series: {pd.notna(annual_report)}")

Non-null values in the series: Apple                True
Samsung              True
Alphabet             True
Foxconn              True
Microsoft            True
Huawei               True
Dell Technlogoies    True
Meta                 True
Sony                 True
Name: Annual Revenue, dtype: bool

Series contain a lot of useful attributes and methods to interact with them. The most common methods are `.head()` [shows top 5 rows of the series] and `.tail()` [show bottom 5 of the series]

In [78]:
print("Top five rows of the annual report")
annual_report.head()

Top five rows of the annual report

Apple        274515
Samsung      200734
Alphabet     182257
Foxconn      181945
Microsoft    143015
Name: Annual Revenue, dtype: int64

In [79]:
print("Bottom five rows of the annual report")
annual_report.tail()

Bottom five rows of the annual report

Microsoft            143015
Huawei               129184
Dell Technlogoies     92224
Meta                  85965
Sony                  84893
Name: Annual Revenue, dtype: int64

Once a series is constructed, we can access all the attributes separately. The main are:

<ul>
    <li>
        .values (data of the series)
    </li>
    <li>
        .index (index of the series)
    </li>
    <li>
        .name (name of the series)
    </li>
    <li>
        .dtype (type assigned)
    </li>
    <li>
        .size (number of elements)
    </li>
</ul>

In [80]:
print(f"Values of the annual report series: \n{annual_report.values}")

print(f"\nIndexes of the annual report series: \n{annual_report.index}")

print(f"\nName of the series: {annual_report.name}")

print(f"Type of the values of the series: {annual_report.dtype}")
print(f"Number of elements in the series: {annual_report.size}")

Values of the annual report series:
[274515 200734 182257 181945 143015 129184  92224  85965  84893]

Indexes of the annual report series:
Index(['Apple', 'Samsung', 'Alphabet', 'Foxconn', 'Microsoft', 'Huawei',
       'Dell Technlogoies', 'Meta', 'Sony'],
      dtype='object')

Name of the series: Annual Revenue
Type of the values of the series: int64
Number of elements in the series: 9

The `.describe()` gives a quick summary of statistics of the series

In [81]:
print(f"Quick summary of the annual report series")
annual_report.describe()

Quick summary of the annual report series

count         9.000000
mean     152748.000000
std       63472.949406
min       84893.000000
25%       92224.000000
50%      143015.000000
75%      182257.000000
max      274515.000000
Name: Annual Revenue, dtype: float64

There are also other statisitical methods

In [82]:
print(f"Median of the annual report series: {annual_report.median()}")

print(f"\nStandard deviation of the annual report series: {annual_report.std()}")

print(f"\nVariance of the annual report series: {annual_report.var()}")

print(f"\nMaximum value of the annual report series:{annual_report.max()}")

Median of the annual report series: 143015.0

Standard deviation of the annual report series: 63472.94940563263

Variance of the annual report series: 4028815306.25

Maximum value of the annual report series:274515

Sorting series is extermely simple. You can sort series by values (`.sort_values()`) or by index (`.sort_index()`). By default, it is sorted in ascending order.

In [83]:
print(f"Annual report series: \n{annual_report}")

print(f"\nSeries sorted by values: \n{annual_report.sort_values().head()}")

print(f"\nSeries sorted by index in descending order: \n{annual_report.sort_index(ascending=False).head()}")

Annual report series:
Apple                274515
Samsung              200734
Alphabet             182257
Foxconn              181945
Microsoft            143015
Huawei               129184
Dell Technlogoies     92224
Meta                  85965
Sony                  84893
Name: Annual Revenue, dtype: int64

Series sorted by values:
Sony                  84893
Meta                  85965
Dell Technlogoies     92224
Huawei               129184
Microsoft            143015
Name: Annual Revenue, dtype: int64

Series sorted by index in descending order:
Sony          84893
Samsung      200734
Microsoft    143015
Meta          85965
Huawei       129184
Name: Annual Revenue, dtype: int64

An important concept in data science and pandas is immutabilty. `In data science, we dont want to mutate or change things as it is harder to keep track of these changes`
<br/><br/>
By default, when you sort series or perform other mutating operations, you dont `actually` sort the series itself,. There's a `new` series returned. The underlying series is not changed

<br/> <br/>
If you do want to mutate your series, you must pass `inplace=True` attribute

In [84]:
print(f"Sorted series: \n{annual_report.sort_values()}")

print(f"\n\nOriginal series after sorting: \n{annual_report}" ) # the original series is not mutated

print('\n-----------------------------------------\n')

annual_report.sort_values(inplace=True)

print(f"Original series after sorting: \n{annual_report}" ) # the original series is also mutated

Sorted series:
Sony                  84893
Meta                  85965
Dell Technlogoies     92224
Huawei               129184
Microsoft            143015
Foxconn              181945
Alphabet             182257
Samsung              200734
Apple                274515
Name: Annual Revenue, dtype: int64


Original series after sorting:
Apple                274515
Samsung              200734
Alphabet             182257
Foxconn              181945
Microsoft            143015
Huawei               129184
Dell Technlogoies     92224
Meta                  85965
Sony                  84893
Name: Annual Revenue, dtype: int64

-----------------------------------------

Original series after sorting:
Sony                  84893
Meta                  85965
Dell Technlogoies     92224
Huawei               129184
Microsoft            143015
Foxconn              181945
Alphabet             182257
Samsung              200734
Apple                274515
Name: Annual Revenue, dtype: int64

Modifying a series is something that we hardly want to do as it is not recommended. However, it is still possible by changing values, adding or removing elements

In [85]:
print("Annual report")
display(annual_report)

print("Changing value of Microsoft\n")

annual_report['Microsoft'] = 320_120
print("Annual report after modification")
display(annual_report)

annual_report['Nvidia'] = 292_564
del annual_report['Sony']

print("Annual report after deleting Sony data and adding Nvidia data")
display(annual_report)

Annual report

Sony                  84893
Meta                  85965
Dell Technlogoies     92224
Huawei               129184
Microsoft            143015
Foxconn              181945
Alphabet             182257
Samsung              200734
Apple                274515
Name: Annual Revenue, dtype: int64

Changing value of Microsoft

Annual report after modification

Sony                  84893
Meta                  85965
Dell Technlogoies     92224
Huawei               129184
Microsoft            320120
Foxconn              181945
Alphabet             182257
Samsung              200734
Apple                274515
Name: Annual Revenue, dtype: int64

Annual report after deleting Sony data and adding Nvidia data

Meta                  85965
Dell Technlogoies     92224
Huawei               129184
Microsoft            320120
Foxconn              181945
Alphabet             182257
Samsung              200734
Apple                274515
Nvidia               292564
Name: Annual Revenue, dtype: int64

We can concatenate two series using the `concat()` method
<br/> <br/>
`series.concat([DF1/Series1, DF2/Series2])`

In [86]:
new_data = pd.Series([150_635, 265_530], index= ['Tesla', 'Google'])

new_annual_report = pd.concat([annual_report, new_data])
display(new_annual_report)

Meta                  85965
Dell Technlogoies     92224
Huawei               129184
Microsoft            320120
Foxconn              181945
Alphabet             182257
Samsung              200734
Apple                274515
Nvidia               292564
Tesla                150635
Google               265530
dtype: int64

### Filtering and Conditional in Series

`Conditional selection` is like filtering or querying. It allow us to answer the following types of questions

<ul>
    <li>
        What companies made more than $x
    </li>
    <li>
        What companies made less than $x
    </li>
    <li>
        What companies made between $x and $y
    </li>
</ul>

`Boolean array` is a way of selecting in which we pass the full index of the series and indicate what elements we want to select and which one we want to skip. We indicate this by passing Boolean values; True or False

In [87]:
display(annual_report)
print(f"\nSelecting certain companies: \n")
display(annual_report.loc[[
    True,      # Apple
    False,     # Samsung
    True,      # Alphabet
    False,     # Foxconn
    True,      # Microsoft
    False,     # Huawei
    True,      # Dell
    True,      # Meta
    False,     # Sony
]])

Meta                  85965
Dell Technlogoies     92224
Huawei               129184
Microsoft            320120
Foxconn              181945
Alphabet             182257
Samsung              200734
Apple                274515
Nvidia               292564
Name: Annual Revenue, dtype: int64

Selecting certain companies:

Meta        85965
Huawei     129184
Foxconn    181945
Samsung    200734
Apple      274515
Name: Annual Revenue, dtype: int64

Only those values are selected for which we have True value

Moreover, series accept comparison operators (boolean operator) like `>` `<` etc

In [88]:
print(f"Companies which revenue exceeds the $200 billion dollar \n{annual_report.loc[annual_report>200_000]}")

Companies which revenue exceeds the $200 billion dollar
Microsoft    320120
Samsung      200734
Apple        274515
Nvidia       292564
Name: Annual Revenue, dtype: int64

In [89]:
print(f"Companies with revenue less than $90,000 million dollar \n{annual_report.loc[annual_report < 90_000]}")

Companies with revenue less than $90,000 million dollar
Meta    85965
Name: Annual Revenue, dtype: int64

In [90]:
print(f"Companies with revenue above average: \n{annual_report.loc[annual_report > annual_report.mean()]}")

Companies with revenue above average:
Microsoft    320120
Samsung      200734
Apple        274515
Nvidia       292564
Name: Annual Revenue, dtype: int64

In [91]:
print(f"Companies with revenue greater than $200 billion or less than $90000 million ")
annual_report.loc[(annual_report < 90_000) | (annual_report > 150_000)]

Companies with revenue greater than $200 billion or less than $90000 million

Meta          85965
Microsoft    320120
Foxconn      181945
Alphabet     182257
Samsung      200734
Apple        274515
Nvidia       292564
Name: Annual Revenue, dtype: int64

In [92]:
print(f"Companies with revenue not less than $150 billion: {annual_report.loc[~(annual_report<150_000)]}")

Companies with revenue not less than $150 billion: Microsoft    320120
Foxconn      181945
Alphabet     182257
Samsung      200734
Apple        274515
Nvidia       292564
Name: Annual Revenue, dtype: int64

In [93]:
print(f"Companies with most and least revenue:\n{annual_report.loc[(annual_report == annual_report.max()) | (annual_report == annual_report.min())]}")

Companies with most and least revenue:
Meta          85965
Microsoft    320120
Name: Annual Revenue, dtype: int64

In [94]:
print("Count of each value")
annual_report.value_counts()

Count of each value

Annual Revenue
85965     1
92224     1
129184    1
320120    1
181945    1
182257    1
200734    1
274515    1
292564    1
Name: count, dtype: int64

We can perform arithmetic process on series (just like we do in numpy known as vectorization)

In [95]:
revenue_in_billions = annual_report / 1000 # arithmetic operations as it is scalar. Same in numpy. Applicable in pandas because pandas is built on top of numpy

print(f"Revenue of companies in billion")
display(revenue_in_billions)

Revenue of companies in billion

Meta                  85.965
Dell Technlogoies     92.224
Huawei               129.184
Microsoft            320.120
Foxconn              181.945
Alphabet             182.257
Samsung              200.734
Apple                274.515
Nvidia               292.564
Name: Annual Revenue, dtype: float64

In [96]:
print(f"Subtracting 10 million taxes")
revenue_in_billions - 10

Subtracting 10 million taxes

Meta                  75.965
Dell Technlogoies     82.224
Huawei               119.184
Microsoft            310.120
Foxconn              171.945
Alphabet             172.257
Samsung              190.734
Apple                264.515
Nvidia               282.564
Name: Annual Revenue, dtype: float64

In [97]:
print(f"Annual revenue in dollars {annual_report * 1_000_000}")

Annual revenue in dollars Meta                  85965000000
Dell Technlogoies     92224000000
Huawei               129184000000
Microsoft            320120000000
Foxconn              181945000000
Alphabet             182257000000
Samsung              200734000000
Apple                274515000000
Nvidia               292564000000
Name: Annual Revenue, dtype: int64

In [98]:
recession_impact = pd.Series([
    0.91, 0.93, 0.98, 0.97, 0.99, 0.89, 0.87,
    0.82, 0.93], index=companies)

We can add, subtract, divide or multiply series with same data length

In [99]:
print(f"Revenue after recession hit {annual_report * recession_impact}\n")

Revenue after recession hit Alphabet             178611.86
Apple                249808.65
Dell Technlogoies     80234.88
Foxconn              176486.65
Huawei               114973.76
Meta                  70491.30
Microsoft            316918.80
Nvidia                     NaN
Samsung              186682.62
Sony                       NaN
dtype: float64

## DataFrame

A `dataframe` represents a rectangular table of data and contains an ordered, named collection of columns, each of which can be a different value type
<br/> <br/>
A dataframe has both a row and column index; it can be thought of as a dictionary of Series all sharing the same index. It provides an efficient way to work with large amount of structured data

<ul>
    <li>Series is a single column in a DataFrame</li>
    <li>Dataframe is entire table of data</li>
</ul>

In [3]:
# Lists of data
data = {'Revenue': [274515,200734,182527,181945,143015,129184,92224,85965,84893,82345,77867,73620,69864,63191],
        'Employees': [147000,267937,135301,878429,163000,197000,158000,58604,109700,350864,110600,364800,85858,243540],
        'Sector': ['Consumer Electronics','Consumer Electronics','Software Services',
                'Chip Manufacturing','Software Services','Consumer Electronics',
                'Consumer Electronics','Software Services','Consumer Electronics',
                'Consumer Electronics','Chip Manufacturing','Software Services',
                'Software Services','Consumer Electronics'],
        'Founding Date':['01-04-1976','13-01-1969','04-09-1998','20-02-1974',
                        '04-04-1975','15-09-1987','01-02-1984','04-02-2004',
                        '07-04-1946','01-01-1910','18-07-1968','16-06-1911',
                        '11-11-1998','07-03-1918'],
        'Country':['USA','South Korea','USA','Taiwan','USA','China','USA','USA',
                'Japan','Japan','USA','USA','China','Japan']} 
index = ['Apple','Samsung','Alphabet','Foxconn','Microsoft','Huawei',
        'Dell Technologies','Meta','Sony','Hitachi','Intel','IBM',
        'Tencent','Panasonic']

In [4]:
top_companies = pd.DataFrame(data, index)
# data are the values of dataset
# index is like address of the data we are storing
top_companies

,Revenue,Employees,Sector,Founding Date,Country
Apple,274515,147000,Consumer Electronics,01-04-1976,USA
Samsung,200734,267937,Consumer Electronics,13-01-1969,South Korea
Alphabet,182527,135301,Software Services,04-09-1998,USA
Foxconn,181945,878429,Chip Manufacturing,20-02-1974,Taiwan
Microsoft,143015,163000,Software Services,04-04-1975,USA
Huawei,129184,197000,Consumer Electronics,15-09-1987,China
Dell Technologies,92224,158000,Consumer Electronics,01-02-1984,USA
Meta,85965,58604,Software Services,04-02-2004,USA
Sony,84893,109700,Consumer Electronics,07-04-1946,Japan
Hitachi,82345,350864,Consumer Electronics,01-01-1910,Japan
Intel,77867,110600,Chip Manufacturing,18-07-1968,USA
IBM,73620,364800,Software Services,16-06-1911,USA
Tencent,69864,85858,Software Services,11-11-1998,China
Panasonic,63191,243540,Consumer Electronics,07-03-1918,Japan

`head()` method displays first few rows of the dataframe to give you a sense of overall structure and content. It is used toe ensure that all of the data is stored correctly and as expected

In [5]:
top_companies.head()

           Revenue  Employees                Sector Founding Date      Country
Apple       274515     147000  Consumer Electronics    01-04-1976          USA
Samsung     200734     267937  Consumer Electronics    13-01-1969  South Korea
Alphabet    182527     135301     Software Services    04-09-1998          USA
Foxconn     181945     878429    Chip Manufacturing    20-02-1974       Taiwan
Microsoft   143015     163000     Software Services    04-04-1975          USA

`tail()` gives the last few rows of the dataframe. This is useful for quickly identifying any problems with the dataset as any errors will most likely be found at the end rather than beginning

In [6]:
top_companies.tail()

           Revenue  Employees                Sector Founding Date Country
Hitachi      82345     350864  Consumer Electronics    01-01-1910   Japan
Intel        77867     110600    Chip Manufacturing    18-07-1968     USA
IBM          73620     364800     Software Services    16-06-1911     USA
Tencent      69864      85858     Software Services    11-11-1998   China
Panasonic    63191     243540  Consumer Electronics    07-03-1918   Japan

`info()` method returns a list of all columns in DataFrame along with their name, data types, number of values and memory usage. Helps you identify potential problems such as missing values or incorrect datatype

In [7]:
top_companies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 14 entries, Apple to Panasonic
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Revenue        14 non-null     int64
 1   Employees      14 non-null     int64
 2   Sector         14 non-null     object
 3   Founding Date  14 non-null     object
 4   Country        14 non-null     object
dtypes: int64(2), object(3)
memory usage: 672.0+ bytes

`shape()` method returns a tuple with the number of rows and columns in dataframe. This gives a quick insight into the dimensionality of our dataframe

In [8]:
top_companies.shape # 14 rows and 5 columns

(14, 5)

`describe()` method displays descriptive statistics for numerical columns in the dataframe. This can be very useful for understanding the distribution of values across a specific dataset or column

In [9]:
top_companies.describe()

             Revenue      Employees
count      14.000000      14.000000
mean   124420.642857  233616.642857
std     63686.481231  207583.087389
min     63191.000000   58604.000000
25%     78986.500000  116775.250000
50%     89094.500000  160500.000000
75%    172212.500000  261837.750000
max    274515.000000  878429.000000

`nunique()` counts the number of distinct elements. Can be useful for understanding the number of categories in a column for example

In [10]:
top_companies.nunique()

Revenue          14
Employees        14
Sector            3
Founding Date    14
Country           5
dtype: int64

`isnull()` detects missing values by creating a dataframe object with boolean values for null values otherwis false

In [11]:
top_companies.isnull()

                   Revenue  Employees  Sector  Founding Date  Country
Apple                False      False   False          False    False
Samsung              False      False   False          False    False
Alphabet             False      False   False          False    False
Foxconn              False      False   False          False    False
Microsoft            False      False   False          False    False
Huawei               False      False   False          False    False
Dell Technologies    False      False   False          False    False
Meta                 False      False   False          False    False
Sony                 False      False   False          False    False
Hitachi              False      False   False          False    False
Intel                False      False   False          False    False
IBM                  False      False   False          False    False
Tencent              False      False   False          False    False
Panasonic            False      False   False          False    False

In [12]:
# calculate total number of null values in each column
top_companies.isnull().sum()

Revenue          0
Employees        0
Sector           0
Founding Date    0
Country          0
dtype: int64

`[]` operator can be used to select a specific column within a DataFrame. The output is a Series

In [13]:
print(f"Country column of dataframe: \n{top_companies['Country']}")
print(f"\nData type: {type(top_companies['Country'])}\n")

Country column of dataframe:
Apple                        USA
Samsung              South Korea
Alphabet                     USA
Foxconn                   Taiwan
Microsoft                    USA
Huawei                     China
Dell Technologies            USA
Meta                         USA
Sony                       Japan
Hitachi                    Japan
Intel                        USA
IBM                          USA
Tencent                    China
Panasonic                  Japan
Name: Country, dtype: object

Data type: <class 'pandas.core.series.Series'>

We can select a column and apply different operations

In [14]:
print(f"Top companies total revenue: {top_companies['Revenue'].sum()}")

Top companies total revenue: 1741889

We can select multiple columns using `[[column1, column2 ...]]`

In [15]:
top_companies[['Revenue', 'Sector']]

                   Revenue                Sector
Apple               274515  Consumer Electronics
Samsung             200734  Consumer Electronics
Alphabet            182527     Software Services
Foxconn             181945    Chip Manufacturing
Microsoft           143015     Software Services
Huawei              129184  Consumer Electronics
Dell Technologies    92224  Consumer Electronics
Meta                 85965     Software Services
Sony                 84893  Consumer Electronics
Hitachi              82345  Consumer Electronics
Intel                77867    Chip Manufacturing
IBM                  73620     Software Services
Tencent              69864     Software Services
Panasonic            63191  Consumer Electronics

We can also select multiple columns and apply operations

In [16]:
top_companies[['Revenue', 'Employees']].mean()

Revenue      124420.642857
Employees    233616.642857
dtype: float64

`Index selection` is done using `.loc` method that allows users to select DataFrame rows and columns by their labels or integer positions. It is most commonly used when a user needs to access specific elements within a dataframe <br/> <br/>

`df.loc[row_label, column_label]`

<br/>

`df.loc[:, column_label]` [All rows of a column]
<br/> <br/>
`df.loc[row_label, :]` [All columns of a row]

In [17]:
print(f"All rows of column revenue: \n{top_companies.loc[:, 'Revenue']}")

print(f"\nAll column of row/index Apple: \n{top_companies.loc['Apple', :]}")

All rows of column revenue:
Apple                274515
Samsung              200734
Alphabet             182527
Foxconn              181945
Microsoft            143015
Huawei               129184
Dell Technologies     92224
Meta                  85965
Sony                  84893
Hitachi               82345
Intel                 77867
IBM                   73620
Tencent               69864
Panasonic             63191
Name: Revenue, dtype: int64

All column of row/index Apple:
Revenue                        274515
Employees                      147000
Sector           Consumer Electronics
Founding Date              01-04-1976
Country                           USA
Name: Apple, dtype: object

In [18]:
print(f"Founding date of Meta: {top_companies.loc['Meta', 'Founding Date']}")

Founding date of Meta: 04-02-2004

In [19]:
top_companies.loc[['Meta', 'Foxconn', 'Microsoft'], 'Revenue']

Meta          85965
Foxconn      181945
Microsoft    143015
Name: Revenue, dtype: int64

`Slicing` is a powerful feature of pandas that enables us to access specific parts of our DataFrame

`df.loc[row_name_start : row_name_stop, column_label]`
<br/> <br/>
`df.loc[row_label, column_name_start : column_name_stop]`
<br/> <br/>
`df.loc[row_name_start : row_name_stop : step, column_label]`
<br/> <br/>
`df.loc[row_label, column_name_start : column_name_stop : step]`

In [20]:
print(f"Select Apple, Samsung, Alphabet and all columns \n{top_companies.loc['Apple':'Alphabet', 'Revenue']}")

Select Apple, Samsung, Alphabet and all columns
Apple       274515
Samsung     200734
Alphabet    182527
Name: Revenue, dtype: int64

In [21]:
top_companies.loc['Apple', 'Revenue' : 'Sector']

Revenue                    274515
Employees                  147000
Sector       Consumer Electronics
Name: Apple, dtype: object

In [22]:
top_companies.loc['Apple':'Sony':2,'Revenue']

Apple                274515
Alphabet             182527
Microsoft            143015
Dell Technologies     92224
Sony                  84893
Name: Revenue, dtype: int64

In [23]:
top_companies.loc['Apple', ::2] # all columns by step 2

Revenue                  274515
Sector     Consumer Electronics
Country                     USA
Name: Apple, dtype: object

We can select by position using `iloc` is used to select rows and columns of a dataframe `based on their integer positions`. This is especially useful when users need to access elements within a Dataframe that do not have labels or specific column names

`df.iloc[row_position, column_position]`

In [24]:
top_companies.iloc[0] # all columns for first index

Revenue                        274515
Employees                      147000
Sector           Consumer Electronics
Founding Date              01-04-1976
Country                           USA
Name: Apple, dtype: object

In [25]:
print(f"Revenue of apple {top_companies.iloc[0, 0]}")
print(f"\nAll data of Samsung: \n{top_companies.iloc[1, :]}")

Revenue of apple 274515

All data of Samsung:
Revenue                        200734
Employees                      267937
Sector           Consumer Electronics
Founding Date              13-01-1969
Country                   South Korea
Name: Samsung, dtype: object

In [26]:
top_companies.iloc[[1, 8, 5], 2]

Samsung    Consumer Electronics
Sony       Consumer Electronics
Huawei     Consumer Electronics
Name: Sector, dtype: object

`Immutability is a key concept of dataframe. Once a dataframe is created, it cannot be changed. Any changes create a new dataframe rather modifying the original one`

The most common way to create a column in just as the result of an expression of other columns within the same dataframe

`df["column name"] = [expression]`

Expression can be anything such as

`df["new column name"] = df["column 1"] + df["column2"]`

In [27]:
top_companies['Revenue Per Employee'] = top_companies['Revenue'] / top_companies['Employees']

In [28]:
top_companies

,Revenue,Employees,Sector,Founding Date,Country,Revenue Per Employee
Apple,274515,147000,Consumer Electronics,01-04-1976,USA,1.867449
Samsung,200734,267937,Consumer Electronics,13-01-1969,South Korea,0.749184
Alphabet,182527,135301,Software Services,04-09-1998,USA,1.349044
Foxconn,181945,878429,Chip Manufacturing,20-02-1974,Taiwan,0.207125
Microsoft,143015,163000,Software Services,04-04-1975,USA,0.877393
Huawei,129184,197000,Consumer Electronics,15-09-1987,China,0.655756
Dell Technologies,92224,158000,Consumer Electronics,01-02-1984,USA,0.583696
Meta,85965,58604,Software Services,04-02-2004,USA,1.466879
Sony,84893,109700,Consumer Electronics,07-04-1946,Japan,0.773865
Hitachi,82345,350864,Consumer Electronics,01-01-1910,Japan,0.234692
Intel,77867,110600,Chip Manufacturing,18-07-1968,USA,0.704042
IBM,73620,364800,Software Services,16-06-1911,USA,0.201809
Tencent,69864,85858,Software Services,11-11-1998,China,0.813716
Panasonic,63191,243540,Consumer Electronics,07-03-1918,Japan,0.259469

### Dataframe Mutation

In simplest form, we can create a new column and assign a hardcoded value

`df["New Column"] = False`

The new column will have all values equal to False

In [29]:
top_companies['Is Tech?'] = True

Instead of providing one value, we can provide a collection of value or series

In [30]:
top_companies['Stock Price'] = [143.28, 49.87, 88.26, 1.83, 253.75, 0,
                43.4, 167.32, 89.1, 52.6, 25.58, 137.35, 48.23, 8.81]

In [31]:
top_companies

,Revenue,Employees,Sector,Founding Date,Country,Revenue Per Employee,Is Tech?,Stock Price
Apple,274515,147000,Consumer Electronics,01-04-1976,USA,1.867449,True,143.28
Samsung,200734,267937,Consumer Electronics,13-01-1969,South Korea,0.749184,True,49.87
Alphabet,182527,135301,Software Services,04-09-1998,USA,1.349044,True,88.26
Foxconn,181945,878429,Chip Manufacturing,20-02-1974,Taiwan,0.207125,True,1.83
Microsoft,143015,163000,Software Services,04-04-1975,USA,0.877393,True,253.75
Huawei,129184,197000,Consumer Electronics,15-09-1987,China,0.655756,True,0.00
Dell Technologies,92224,158000,Consumer Electronics,01-02-1984,USA,0.583696,True,43.40
Meta,85965,58604,Software Services,04-02-2004,USA,1.466879,True,167.32
Sony,84893,109700,Consumer Electronics,07-04-1946,Japan,0.773865,True,89.10
Hitachi,82345,350864,Consumer Electronics,01-01-1910,Japan,0.234692,True,52.60
Intel,77867,110600,Chip Manufacturing,18-07-1968,USA,0.704042,True,25.58
IBM,73620,364800,Software Services,16-06-1911,USA,0.201809,True,137.35
Tencent,69864,85858,Software Services,11-11-1998,China,0.813716,True,48.23
Panasonic,63191,243540,Consumer Electronics,07-03-1918,Japan,0.259469,True,8.81

There are mainly two ways of deleting columns

<ul>
    <li>del keyword</li>
    <li>drop method</li>
</ul>

`del` keyword is the simplest way to delete a column

In [32]:
del top_companies['Is Tech?']

In [33]:
top_companies

,Revenue,Employees,Sector,Founding Date,Country,Revenue Per Employee,Stock Price
Apple,274515,147000,Consumer Electronics,01-04-1976,USA,1.867449,143.28
Samsung,200734,267937,Consumer Electronics,13-01-1969,South Korea,0.749184,49.87
Alphabet,182527,135301,Software Services,04-09-1998,USA,1.349044,88.26
Foxconn,181945,878429,Chip Manufacturing,20-02-1974,Taiwan,0.207125,1.83
Microsoft,143015,163000,Software Services,04-04-1975,USA,0.877393,253.75
Huawei,129184,197000,Consumer Electronics,15-09-1987,China,0.655756,0.00
Dell Technologies,92224,158000,Consumer Electronics,01-02-1984,USA,0.583696,43.40
Meta,85965,58604,Software Services,04-02-2004,USA,1.466879,167.32
Sony,84893,109700,Consumer Electronics,07-04-1946,Japan,0.773865,89.10
Hitachi,82345,350864,Consumer Electronics,01-01-1910,Japan,0.234692,52.60
Intel,77867,110600,Chip Manufacturing,18-07-1968,USA,0.704042,25.58
IBM,73620,364800,Software Services,16-06-1911,USA,0.201809,137.35
Tencent,69864,85858,Software Services,11-11-1998,China,0.813716,48.23
Panasonic,63191,243540,Consumer Electronics,07-03-1918,Japan,0.259469,8.81

The `drop()` method accpets the indices of the values we want to remove and is by default immutable (return a new dataframe instead of modifying the original one). If we want to mutate original dataframe, we have to pass `inplace = True`

In [43]:
top_companies.loc[top_companies['Revenue'].index]

,Revenue,Employees,Sector,Founding Date,Country,Revenue Per Employee,Stock Price
Apple,274515,147000,Consumer Electronics,01-04-1976,USA,1.867449,143.28
Samsung,200734,267937,Consumer Electronics,13-01-1969,South Korea,0.749184,49.87
Alphabet,182527,135301,Software Services,04-09-1998,USA,1.349044,88.26
Foxconn,181945,878429,Chip Manufacturing,20-02-1974,Taiwan,0.207125,1.83
Microsoft,143015,163000,Software Services,04-04-1975,USA,0.877393,253.75
Huawei,129184,197000,Consumer Electronics,15-09-1987,China,0.655756,0.00
Dell Technologies,92224,158000,Consumer Electronics,01-02-1984,USA,0.583696,43.40
Meta,85965,58604,Software Services,04-02-2004,USA,1.466879,167.32
Sony,84893,109700,Consumer Electronics,07-04-1946,Japan,0.773865,89.10
Hitachi,82345,350864,Consumer Electronics,01-01-1910,Japan,0.234692,52.60
IBM,73620,364800,Software Services,16-06-1911,USA,0.201809,137.35
Panasonic,63191,243540,Consumer Electronics,07-03-1918,Japan,0.259469,8.81

In [34]:
top_companies.drop(['Intel', 'Tencent'], inplace=True)

Deleting rows based on condition is simple. Since the `.drop()` recieves index of the values we want to delete. So to delete row, we select the columns and in the end apply `.index`

`df.drop(df.loc[df.['column'] condition].index)`

In [35]:
print(f"Companies with revenue less than 80,000 million:")

top_companies.loc[top_companies["Revenue"]< 80000]

Companies with revenue less than 80,000 million:

,Revenue,Employees,Sector,Founding Date,Country,Revenue Per Employee,Stock Price
IBM,73620,364800,Software Services,16-06-1911,USA,0.201809,137.35
Panasonic,63191,243540,Consumer Electronics,07-03-1918,Japan,0.259469,8.81

In [36]:
print(f"Deleting companies with revenue less than 80,000 million")

top_companies.drop(top_companies.loc[top_companies['Revenue'] < 80000].index)

Deleting companies with revenue less than 80,000 million

,Revenue,Employees,Sector,Founding Date,Country,Revenue Per Employee,Stock Price
Apple,274515,147000,Consumer Electronics,01-04-1976,USA,1.867449,143.28
Samsung,200734,267937,Consumer Electronics,13-01-1969,South Korea,0.749184,49.87
Alphabet,182527,135301,Software Services,04-09-1998,USA,1.349044,88.26
Foxconn,181945,878429,Chip Manufacturing,20-02-1974,Taiwan,0.207125,1.83
Microsoft,143015,163000,Software Services,04-04-1975,USA,0.877393,253.75
Huawei,129184,197000,Consumer Electronics,15-09-1987,China,0.655756,0.00
Dell Technologies,92224,158000,Consumer Electronics,01-02-1984,USA,0.583696,43.40
Meta,85965,58604,Software Services,04-02-2004,USA,1.466879,167.32
Sony,84893,109700,Consumer Electronics,07-04-1946,Japan,0.773865,89.10
Hitachi,82345,350864,Consumer Electronics,01-01-1910,Japan,0.234692,52.60

In [44]:
top_companies.rename(columns={'Revenue': 'Annual Revenue'})

,Annual Revenue,Employees,Sector,Founding Date,Country,Revenue Per Employee,Stock Price
Apple,274515,147000,Consumer Electronics,01-04-1976,USA,1.867449,143.28
Samsung,200734,267937,Consumer Electronics,13-01-1969,South Korea,0.749184,49.87
Alphabet,182527,135301,Software Services,04-09-1998,USA,1.349044,88.26
Foxconn,181945,878429,Chip Manufacturing,20-02-1974,Taiwan,0.207125,1.83
Microsoft,143015,163000,Software Services,04-04-1975,USA,0.877393,253.75
Huawei,129184,197000,Consumer Electronics,15-09-1987,China,0.655756,0.00
Dell Technologies,92224,158000,Consumer Electronics,01-02-1984,USA,0.583696,43.40
Meta,85965,58604,Software Services,04-02-2004,USA,1.466879,167.32
Sony,84893,109700,Consumer Electronics,07-04-1946,Japan,0.773865,89.10
Hitachi,82345,350864,Consumer Electronics,01-01-1910,Japan,0.234692,52.60
IBM,73620,364800,Software Services,16-06-1911,USA,0.201809,137.35
Panasonic,63191,243540,Consumer Electronics,07-03-1918,Japan,0.259469,8.81

In [136]:
# df['mode'] = df['mode'].replace({0: 'Minor', 1: 'Major'})
# df['tempo'] = df['tempo'].clip(upper=150)
# df.loc[df['year'] < 1950, 'year'] = 1950

### Dataframe Sorting

Sorting in dataframe is easy using two methods:

<ul>
    <li>.sort_values()</li>
    <li>.sort_index()</li>
</ul>

In default form, sort.values() takes the columns to use as sorting and returns `a new dataframe` sorted in `ascending order` by that column

In [137]:
top_companies.sort_values(by='Revenue')

,Revenue,Employees,Sector,Founding Date,Country,Revenue Per Employee,Stock Price
Panasonic,63191,243540,Consumer Electronics,07-03-1918,Japan,0.259469,8.81
IBM,73620,364800,Software Services,16-06-1911,USA,0.201809,137.35
Hitachi,82345,350864,Consumer Electronics,01-01-1910,Japan,0.234692,52.60
Sony,84893,109700,Consumer Electronics,07-04-1946,Japan,0.773865,89.10
Meta,85965,58604,Software Services,04-02-2004,USA,1.466879,167.32
Dell Technologies,92224,158000,Consumer Electronics,01-02-1984,USA,0.583696,43.40
Huawei,129184,197000,Consumer Electronics,15-09-1987,China,0.655756,0.00
Microsoft,143015,163000,Software Services,04-04-1975,USA,0.877393,253.75
Foxconn,181945,878429,Chip Manufacturing,20-02-1974,Taiwan,0.207125,1.83
Alphabet,182527,135301,Software Services,04-09-1998,USA,1.349044,88.26
Samsung,200734,267937,Consumer Electronics,13-01-1969,South Korea,0.749184,49.87
Apple,274515,147000,Consumer Electronics,01-04-1976,USA,1.867449,143.28

We can pass multiple column as sorting parameter and any tie would be broken by the second column. `This means that if two columns are equal when sorted with first parameter, it is then sorted by the second parameter`

In [140]:
top_companies.sort_values(by=['Sector', 'Revenue'], ascending=[False, True])

,Revenue,Employees,Sector,Founding Date,Country,Revenue Per Employee,Stock Price
IBM,73620,364800,Software Services,16-06-1911,USA,0.201809,137.35
Meta,85965,58604,Software Services,04-02-2004,USA,1.466879,167.32
Microsoft,143015,163000,Software Services,04-04-1975,USA,0.877393,253.75
Alphabet,182527,135301,Software Services,04-09-1998,USA,1.349044,88.26
Panasonic,63191,243540,Consumer Electronics,07-03-1918,Japan,0.259469,8.81
Hitachi,82345,350864,Consumer Electronics,01-01-1910,Japan,0.234692,52.60
Sony,84893,109700,Consumer Electronics,07-04-1946,Japan,0.773865,89.10
Dell Technologies,92224,158000,Consumer Electronics,01-02-1984,USA,0.583696,43.40
Huawei,129184,197000,Consumer Electronics,15-09-1987,China,0.655756,0.00
Samsung,200734,267937,Consumer Electronics,13-01-1969,South Korea,0.749184,49.87
Apple,274515,147000,Consumer Electronics,01-04-1976,USA,1.867449,143.28
Foxconn,181945,878429,Chip Manufacturing,20-02-1974,Taiwan,0.207125,1.83

There are two main methods to query data in dataframe

<ul>
    <li>
        `query()` method allows you to filter a dataframe based on a query expression written in string
        <ul>
            <li>Makes code more readable</li>
            <li>Good for complex conditions</li>
        </ul> 
    </li>
    <li>
        `loc()` method is a more general purpose tool for selecting rows and columns based on label (index) or boolean condition
        <ul>
            <li>Makes code more readable</li>
            <li>Good for complex conditions</li>
        </ul> 
    </li>
</ul>

<ul>
    <li>
        Readability
        <ul>
            <li>query() oftenmore readable and concise</li>
            <li>.loc[] verbose with complex conditions but more flexible
            </li>
        </ul>
    </li>
    <li>
        Performance
        <ul>
            <li>query() slightly faster for large Dataframes</li>
            <li>.loc[] slower with complex conditions
            </li>
        </ul>
    </li>
    <li>
        Performance
        <ul>
            <li>query() cannot handlt dynamic columns directly (column names stored in variables)</li>
            <li>
                .loc[] handles dynamic column names and more complex indexing tasks
            </li>
        </ul>
    </li>
</ul>

In [ ]:
long_name_age = df.query('club_name == "Manchester City"')[['long_name', 'age']] # select the name and age of player whose club is equal to Manchester City

Similar to what we did with Series, we can combine multiple expressions with boolean operators: and (&), or (|) and not (~). Make sure to include parethensis between conditions

In [45]:
top_companies.loc[(top_companies['Revenue'] > top_companies['Revenue'].mean()) & (top_companies['Country'] == 'USA')]

,Revenue,Employees,Sector,Founding Date,Country,Revenue Per Employee,Stock Price
Apple,274515,147000,Consumer Electronics,01-04-1976,USA,1.867449,143.28
Alphabet,182527,135301,Software Services,04-09-1998,USA,1.349044,88.26
Microsoft,143015,163000,Software Services,04-04-1975,USA,0.877393,253.75

In [46]:
mean_revenue = top_companies['Revenue'].mean()
top_companies.query("Revenue > @mean_revenue") # referncing above variable

,Revenue,Employees,Sector,Founding Date,Country,Revenue Per Employee,Stock Price
Apple,274515,147000,Consumer Electronics,01-04-1976,USA,1.867449,143.28
Samsung,200734,267937,Consumer Electronics,13-01-1969,South Korea,0.749184,49.87
Alphabet,182527,135301,Software Services,04-09-1998,USA,1.349044,88.26
Foxconn,181945,878429,Chip Manufacturing,20-02-1974,Taiwan,0.207125,1.83
Microsoft,143015,163000,Software Services,04-04-1975,USA,0.877393,253.75

In [ ]:
# df.loc[df["view_count"] >= 1000000, ["view_count", "speaker_name"]] # select all data where view count is greater than one million. Only select view_count and speaker_name columns

### Data Cleaning and Preperation

`Data cleaning and preperation` are crucial steps in data analytics process as it ensures that the data used for data analytics is accurate, consistent and usable

Data cleaning is done to

<ul>
    <li>
        Ensure the data is correct and free from errors
    </li>
    <li>
        Ensure the data is uniform across different sources and formats
    </li>
    <li>
        Ensure there is no missing or incomplete values
    </li>
    <li>
        Ensure the data is relevant to the analysis being performed
    </li>
    <li>
        Improve the efficieny of data processing and analysis
    </li>
</ul>

The process of data cleaning and preparation involves several steps including

<ul>
    <li>
        <b>Data Collection: </b>Gathering data from various sources such as databases, spreadsheets, APIs and more
    </li>
    <li>
        <b>Data Inspection: </b>Involves initial examination of the data to understand its structure, types, and issues
        <ul>
            <li>Involves using pandas functions like head(), info(), describe()</li>
        </ul>
    </li>
    <li>
        <b>Data Cleaning: </b>It involves
        <ul>
            <li>
                Handling missing values (remove, impute, or fill in values)
                <ul>
                    <li>
                        Use methods like fillna()
                    </li>
                </ul>
            </li>
            <li>
                Removing duplicates (identify and remove duplicate values)
                <ul>
                    <li>
                        drop_duplicates()
                    </li>
                </ul>
            </li>
            <li>
                Handling outliers (identify and handle outliers that may skew the analysis)
            </li>
            <li>
                Correcting errors (correct errors such as typos, inccorect data entries, and formatting issues)
            </li>
        </ul>
    </li>
    <li>
        <b>Data Transformation: </b>It involves
        <ul>
            <li>
                Normalization (adjust data to a common scale)
                <ul>
                    <li>
                        UUsing preprocessing libraries functions like StandardScaler
                    </li>
                </ul>
            </li>
            <li>
                Encoding categorical data (convert categorical data into numerical format)
                <ul>
                    <li>
                        pd.get_dummies()
                    </li>
                </ul>
            </li>
            <li>
                Data type conversion (Convert data to appropriate types for analysis)
            </li>
            <li>
                Correcting errors (correct errors such as typos, inccorect data entries, and formatting issues)
            </li>
        </ul>
    </li>
    <li>
        <b>Data Integration: </b>Combine data from different sources and formats into a single dataset
        <ul>
                    <li>
                        pd.merge()
                    </li>
                </ul>
    </li>
    <li>
        <b>Data Reduction: </b>Reduce the volume of data by aggregating or selecting a subset of data for analysis
        <ul>
                    <li>
                        df.groupby()
                    </li>
                </ul>
    </li>
    <li>
        <b>Data Validation: </b>Ensure the cleaned data meets the requirements for analysis through validation checks
    </li>
</ul>

#### Handling missing data

In pandas, `NA` means missing data or Not Available. None is also treated as NA

In [7]:
float_data = pd.Series([None, -3.5, np.nan, 0])
float_data

0    NaN
1   -3.5
2    NaN
3    0.0
dtype: float64

We can look for missing or invalid values using `isna()` method

In [6]:
print("Checking for NA in the series")
float_data.isna()

Checking for NA in the series

0    False
1    False
2     True
3    False
dtype: bool

We can either frop the axis containing missing data or replace the NA with some values

In [8]:
print("Dropping NA isn the series")
float_data.dropna() #new series is created, the original remains same

Dropping NA isn the series

1   -3.5
3    0.0
dtype: float64

In [12]:
print("Filling the NA with values")
float_data.fillna(5) #replace NA with 5

Filling the NA with values

0    5.0
1   -3.5
2    5.0
3    0.0
dtype: float64

Instead of dropping, we can filter out NA data

In [15]:
float_data[float_data.notna()] # take only non na values

1   -3.5
3    0.0
dtype: float64

We can also use `replace()` method to replace NA values with some data

In [25]:
float_data.replace(np.nan, float_data.mean())

0   -1.75
1   -3.50
2   -1.75
3    0.00
dtype: float64

We can pass an array to replace multiple values

In [26]:
float_data.replace([np.nan, -3.50], float_data.median())

0   -1.75
1   -1.75
2   -1.75
3    0.00
dtype: float64

#### Data Transformation

Duplicate entries can impact analysis and pre-processing and can lead to bias. DataFrame method `duplicated` returns a Boolean series indicating whether each row is duplicated or not

In [16]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})

In [17]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

We can drop duplicates using `.drop_duplicates()`

In [20]:
data.drop_duplicates() # considers column by default. It returns a new dataframe with duplicate rows removed.

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

We can rename columns and indexes of dataframe using `.rename()` method

In [31]:
data.rename(columns={'k1': 'Column 1', 'k2': 'Column 2'}, index={0 : 'First Index', 6 : 'Last Index'})

            Column 1  Column 2
First Index      one         1
1                two         1
2                one         2
3                two         3
4                one         3
5                two         4
Last Index       two         4

Filtering or transforming outliers is largely a matter of applying array operations.

In [33]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data

            0         1         2         3
0    0.578930  0.945805  1.591450  1.002726
1    0.014375  0.417671  0.499759 -0.975068
2   -0.708358  1.775295 -0.028873  0.775256
3    1.049983  1.086802  0.552416  0.639667
4    0.424631 -0.133227 -0.651562 -1.097919
..        ...       ...       ...       ...
995 -0.768437  0.163928  0.448699 -0.508474
996 -0.404121 -2.143486 -0.735097 -0.553242
997  1.032402  0.668210  0.611257 -0.262439
998 -0.674692 -1.020023 -0.116220  0.678856
999 -0.722701  2.168130  0.358761  0.534058

[1000 rows x 4 columns]

In [35]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.043529     0.078734     0.005055    -0.035653
std       1.000605     1.001164     0.985553     0.965116
min      -3.207135    -2.986981    -3.052634    -3.171497
25%      -0.639907    -0.597905    -0.624819    -0.639810
50%       0.008578     0.051456     0.003476    -0.024785
75%       0.718367     0.786493     0.634888     0.638591
max       3.397749     3.038277     3.583611     2.910487

Suppose we want to select all row between certain range, we can use `.any()` method

In [37]:
data[(data.abs() > 3).any(axis="columns")] # selecting all rows having a valu exceeding 3 or -3

            0         1         2         3
21  -0.130979  1.519571  3.583611  0.395833
164  0.404697  0.017229  0.773110 -3.171497
202  1.067901  3.038277  0.655721 -0.127391
298 -3.207135 -0.784559  2.023243 -0.613352
318  3.191848  1.314930 -0.414303  1.277808
552  3.397749  0.114614  0.279696  1.103037
666  0.183838 -0.205681 -3.052634 -0.077679
677  1.085652  0.065500  3.063421 -0.582261
759 -3.101115  0.469758  1.104758 -0.597113
840  0.498499  0.096635 -3.015551 -0.031100

For encode categorical data into integers, we use `.get_dummies()` function

In [39]:
f = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
"data1": range(6)}) # we have three categories a,b and c

pd.get_dummies(f["key"], prefix="key") # key column is one with categorical data

   key_a  key_b  key_c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

#### Practice

In [50]:
df = pd.read_csv('E:/Web 3.0/Next.js 13 and TailwindCSS/Projects/genai-learning-repo/data-analysis-course/datasets/new_york_airbnb_data/train.csv')

In [51]:
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

In [57]:
print(f"Size of dataset: {df.size}")
print(f"Number of hosts: {len(df)}")
print(f"Number of columns: {len(df.columns)}")

Size of dataset: 782320
Number of hosts: 48895
Number of columns: 16

In [59]:
print("Types of data")
df.dtypes

Types of data

id                                  int64
name                               object
host_id                             int64
host_name                          object
neighbourhood_group                object
neighbourhood                      object
latitude                          float64
longitude                         float64
room_type                          object
price                               int64
minimum_nights                      int64
number_of_reviews                   int64
last_review                        object
reviews_per_month                 float64
calculated_host_listings_count      int64
availability_365                    int64
dtype: object

In [60]:
print("Missing values in each column\n")
df.isnull().sum()

Missing values in each column

id                                    0
name                                 16
host_id                               0
host_name                            21
neighbourhood_group                   0
neighbourhood                         0
latitude                              0
longitude                             0
room_type                             0
price                                 0
minimum_nights                        0
number_of_reviews                     0
last_review                       10052
reviews_per_month                 10052
calculated_host_listings_count        0
availability_365                      0
dtype: int64

In [62]:
print("Dropping 'reviews_per_month' column as it has large amount of NA")
df.drop('reviews_per_month', axis=1, inplace=True)

Dropping 'reviews_per_month' column as it has large amount of NA

In [63]:
print(f"Dropping rows that have more than one missing values \n")
df.dropna(thresh=df.shape[1]-1)

Dropping rows that have more than one missing values

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48890,36484665,Charming one bedroom - newly renovated rowhouse,8232441,Sabrina,Brooklyn,Bedford-Stuyvesant,40.67853,-73.94995,Private room,70,2,0,NaN,2,9
48891,36485057,Affordable room in Bushwick/East Williamsburg,6570630,Marisol,Brooklyn,Bushwick,40.70184,-73.93317,Private room,40,4,0,NaN,2,36
48892,36485431,Sunny Studio at Historical Neighborhood,23492952,Ilgar & Aysel,Manhattan,Harlem,40.81475,-73.94867,Entire home/apt,115,10,0,NaN,1,27
48893,36485609,43rd St. Time Square-cozy single bed,30985759,Taz,Manhattan,Hell's Kitchen,40.75751,-73.99112,Shared room,55,1,0,NaN,6,2
48894,36487245,Trendy duplex in the very heart of Hell's Kitchen,68119814,Christophe,Manhattan,Hell's Kitchen,40.76404,-73.98933,Private room,90,7,0,NaN,1,23

In [65]:
print("Replacing missing value in host_name with Airbnb \n")
df['host_name'].fillna('Airbnb')

Replacing missing value in host_name with Airbnb

0                 John
1             Jennifer
2            Elisabeth
3          LisaRoxanne
4                Laura
             ...
48890          Sabrina
48891          Marisol
48892    Ilgar & Aysel
48893              Taz
48894       Christophe
Name: host_name, Length: 48895, dtype: object

In [70]:
print(f"Checking if host_name has digits or numbers as value in it\n")

print(f"Number of alphabets: {df['host_name'].str.isalpha().sum()}")
print(f"Number of spaces: {df['host_name'].str.isspace().sum()}")
print(f"Number of digits: {df['host_name'].str.isdigit().sum()}")

Checking if host_name has digits or numbers as value in it

Number of alphabets: 44929
Number of spaces: 0
Number of digits: 6

In [71]:
print(f"Filling the missing value of 'price' column with mean of it\n")

df['price'].fillna(df['price'].mean())

Filling the missing value of 'price' column with mean of it

0        149
1        225
2        150
3         89
4         80
        ...
48890     70
48891     40
48892    115
48893     55
48894     90
Name: price, Length: 48895, dtype: int64

In [72]:
print(f"Filling all missing values in last_review using forward filling method: {df['last_review'].ffill()}")

Filling all missing values in last_review using forward filling method: 0        2018-10-19
1        2019-05-21
2        2019-05-21
3        2019-07-05
4        2018-11-19
            ...
48890    2019-07-08
48891    2019-07-08
48892    2019-07-08
48893    2019-07-08
48894    2019-07-08
Name: last_review, Length: 48895, dtype: object

In [75]:
print("Selecting duplicate hosts in a dataframe based on name, host_id, and price columns\n")

df[df.duplicated(subset=['name', 'host_id', 'price'], keep=False)] # keep=False is used to drop all duplicates

Selecting duplicate hosts in a dataframe based on name, host_id, and price columns

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,calculated_host_listings_count,availability_365
321,77765,Superior @ Box House,417504,The Box House Hotel,Brooklyn,Greenpoint,40.73749,-73.95292,Private room,179,3,36,2019-07-01,28,79
327,80684,Duplex w/ Terrace @ Box House Hotel,417504,The Box House Hotel,Brooklyn,Greenpoint,40.73776,-73.95327,Private room,349,3,8,2016-03-27,28,60
330,81739,Loft w/ Terrace @ Box House Hotel,417504,The Box House Hotel,Brooklyn,Greenpoint,40.73842,-73.95312,Private room,249,3,2,2011-05-12,28,60
339,84010,Superior @ Box House,417504,The Box House Hotel,Brooklyn,Greenpoint,40.73813,-73.95394,Private room,179,3,13,2019-06-27,28,81
447,158061,Hancock Town House!-Stuyvesant Mews,758441,Fred,Brooklyn,Bedford-Stuyvesant,40.68669,-73.91989,Private room,165,1,27,2017-10-08,4,311
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
47965,36003858,★Premier Queen Room with Balcony ★,270874051,Hotel Vetiver,Queens,Long Island City,40.75436,-73.93483,Private room,99,1,0,NaN,8,319
48026,36039574,★Premier Queen Room with Balcony ★,270874051,Hotel Vetiver,Queens,Long Island City,40.75300,-73.93485,Private room,99,1,0,NaN,8,319
48662,36372006,Very Clean Private Room Near Buses & Restauran...,118405437,PengYu,Queens,Woodhaven,40.69411,-73.86877,Private room,66,1,0,NaN,2,365
48677,36381008,Comfort home,266211707,Yan,Brooklyn,Sunset Park,40.64454,-74.02010,Private room,185,1,0,NaN,2,175
48684,36382847,Comfort home,266211707,Yan,Brooklyn,Sunset Park,40.64439,-74.01816,Private room,185,1,0,NaN,2,177

In [76]:
print(f"Dropping duplicates while keeping the first non-Nan value\n")
df.drop_duplicates(subset=['name', 'host_id', 'price'], keep='first')

Dropping duplicates while keeping the first non-Nan value

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48890,36484665,Charming one bedroom - newly renovated rowhouse,8232441,Sabrina,Brooklyn,Bedford-Stuyvesant,40.67853,-73.94995,Private room,70,2,0,NaN,2,9
48891,36485057,Affordable room in Bushwick/East Williamsburg,6570630,Marisol,Brooklyn,Bushwick,40.70184,-73.93317,Private room,40,4,0,NaN,2,36
48892,36485431,Sunny Studio at Historical Neighborhood,23492952,Ilgar & Aysel,Manhattan,Harlem,40.81475,-73.94867,Entire home/apt,115,10,0,NaN,1,27
48893,36485609,43rd St. Time Square-cozy single bed,30985759,Taz,Manhattan,Hell's Kitchen,40.75751,-73.99112,Shared room,55,1,0,NaN,6,2
48894,36487245,Trendy duplex in the very heart of Hell's Kitchen,68119814,Christophe,Manhattan,Hell's Kitchen,40.76404,-73.98933,Private room,90,7,0,NaN,1,23

In [79]:
private_room_counts = df['room_type'].str.count('Private room')
private_room_counts = private_room_counts.sum()
print(f"Users in column 'room_type' that are 'Private room': {private_room_counts}")

Users in column 'room_type' that are 'Private room': 22326

In [80]:
print("Replacing the neighbourhood having Kitchen with Restaurant\n")

df['neighbourhood'].replace('Kitchen', 'Restaurant', regex=True)

Replacing the neighbourhood having Kitchen with Restaurant

0                Kensington
1                   Midtown
2                    Harlem
3              Clinton Hill
4               East Harlem
                ...
48890    Bedford-Stuyvesant
48891              Bushwick
48892                Harlem
48893     Hell's Restaurant
48894     Hell's Restaurant
Name: neighbourhood, Length: 48895, dtype: object

#### Practice 2

### Data Wrangling

Data wrangling is the process of transforming raw data into a format that is suitable for analysis. This involves various steps such as cleaning, structuring, and enriching

Data wrangling is done to

<ul>
    <li>
        Ensure the data is accurate, consistent and reliable
    </li>
    <li>
        Transforms data into a format that can be easily analyzed
    </li>
    <li>
        Make data ready for advanced analytics, machine learning models, and visualization
    </li>
    <li>
        Reduce time and effort needed for data preprocessing before analysis
    </li>
</ul>

The process of data cleaning and preparation involves several steps including

<ul>
    <li>
        <b>Data Collection: </b>Gathering data from various sources such as databases, spreadsheets, APIs and more
    </li>
    <li>
        <b>Data Cleaning: </b>It involves
        <ul>
            <li>
                Handling missing values (remove, impute, or fill in values)
                <ul>
                    <li>
                        Use methods like fillna()
                    </li>
                </ul>
            </li>
            <li>
                Removing duplicates (identify and remove duplicate values)
                <ul>
                    <li>
                        drop_duplicates()
                    </li>
                </ul>
            </li>
            <li>
                Handling outliers (identify and handle outliers that may skew the analysis)
            </li>
            <li>
                Correcting errors (correct errors such as typos, inccorect data entries, and formatting issues)
            </li>
        </ul>
    </li>
    <li>
        <b>Data Transformation: </b>It involves
        <ul>
            <li>
                Normalization (adjust data to a common scale)
                <ul>
                    <li>
                        UUsing preprocessing libraries functions like StandardScaler
                    </li>
                </ul>
            </li>
            <li>
                Encoding categorical data (convert categorical data into numerical format)
                <ul>
                    <li>
                        pd.get_dummies()
                    </li>
                </ul>
            </li>
            <li>
                Data type conversion (Convert data to appropriate types for analysis)
            </li>
            <li>
                Correcting errors (correct errors such as typos, inccorect data entries, and formatting issues)
            </li>
        </ul>
    </li>
    <li>
        <b>Data Enrichment: </b>Enhancing the data by additional information or deriving new features
        <ul>
            <li>
                df['new_feature'] = df['existing_feature_1'] + df['existing_feature_2']
            </li>
        </ul>
    </li>
    <li>
        <b>Data Validation: </b>Ensures the final dataset is accurate and meets the requirements for analysis
    </li>
</ul>

`Hierarchical indexing` is an important feature that enables to have multiple index level on an axis